BEGIN {
# Скрипт чтения словарных баз в массивы
# Последняя версия файла тут: https://github.com/Balamoote/tts-scripts
    # let @a=1|%s/;DIC\["\zs[0-9]\+\ze"\]/\=''.(@a+setreg('a',@a+1))/g|%s/k<=\zs\d\+\ze;/\=''.(@a-1)/g
    # %s:\[$1\];\zs\ze:DIC["1"]++;:gc
    # %s:DIC\["\d\+"\]++;::gc

 # Проверяем версию gawk, если меньше 5.2.1, то выключаем функции сохранения и восстановления массивов и переменных: базы тогда читаются всегда заново.
    redix=gawk52="42"
    cmd = "awk -Wversion | head -1"
    cmd|getline verheader; close(cmd)
    split(verheader, gnuawk, "[ .,]")
    if (gnuawk[1] == "GNU" && gnuawk[2] == "Awk" && gnuawk[3] >= 5 && gnuawk[4] >= 2 && gnuawk[5] >= 1) { gawk52 = 1 };
 # Если словари и этот скрипт не изменились и gawk>=5.2.1, восстановить состояние, иначе прочитать всё заново.
   if ( gawk52 == 1 && !noredix ) {
     if (locdic ~ "^scriptdb\x2f$") { cmd = "md5sum -c --status " inax "classes.md5 >/dev/null 2>&1" }
     else { cmd = "md5sum -c --status " locdic "classes.md5 >/dev/null 2>&1" }
    redix = system(cmd); close(cmd);};

   if (locdic ~ "^scriptdb\x2f$") { classcache = inax "classes.bin" } else { classcache = locdic "classes.bin" };

   if ( !noredix ) {

   if ( redix == 0 && gawk52 == 1) { readall(classcache) } else {

   cmd = "zcat " locdic "dic_prq.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($4== "NOP") { continue };

      if($2~ /_ед_жен_/ ){
       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]ю(ся)?$/  ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_тв$/          ){  pq2_ne_vz_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_тв$/          ){  pq2_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_тв$/              ){  pq2_ne_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_тв$/              ){  pq2_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_тв$/              ){  pq2_pe_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_тв$/              ){  pq2_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_тв$/        ){  pq2_pe_sd_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_тв$/        ){  pq2_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_тв$/              ){  pq2_pn_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_тв$/              ){  pq2_pn_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_тв$/         ){  pqn_ne_vz_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_тв$/         ){  pqn_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_тв$/             ){  pqn_ne_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_тв$/             ){  pqn_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_тв$/             ){  pqn_pe_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_тв$/             ){  pqn_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_тв$/       ){  pqn_pe_sd_na_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_тв$/       ){  pqn_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_тв$/             ){  pqn_pn_na_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_тв$/             ){  pqn_pn_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_тв$/           ){  pqs_ne_vz_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_тв$/               ){  pqs_ne_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_тв$/               ){  pqs_pe_pa_ed_ze_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_тв$/         ){  pqs_pe_sd_pa_ed_ze_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_тв$/               ){  pqs_pn_pa_ed_ze_tv     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]й(ся)?$/  ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_тв$/          ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_тв$/          ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_тв$/              ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_тв$/              ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_тв$/              ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_тв$/              ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_тв$/        ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_тв$/        ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_тв$/              ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_тв$/              ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_тв$/         ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_тв$/         ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_тв$/             ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_тв$/             ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_тв$/             ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_тв$/             ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_тв$/       ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_тв$/       ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_тв$/             ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_тв$/             ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_тв$/           ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_тв$/               ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_тв$/               ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_тв$/         ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_тв$/               ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_дат$/         ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_дат$/         ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_дат$/             ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_дат$/             ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_дат$/             ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_дат$/             ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_дат$/       ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_дат$/       ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_дат$/             ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_дат$/             ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_дат$/        ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_дат$/        ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_дат$/            ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_дат$/            ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_дат$/            ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_дат$/            ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_дат$/      ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_дат$/      ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_дат$/            ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_дат$/            ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_дат$/          ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_дат$/              ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_дат$/              ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_дат$/        ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_дат$/              ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_пр$/          ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_пр$/          ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_пр$/              ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_пр$/              ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_пр$/              ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_пр$/              ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_пр$/        ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_пр$/        ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_пр$/              ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_пр$/              ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_пр$/         ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_пр$/         ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_пр$/             ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_пр$/             ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_пр$/             ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_пр$/             ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_пр$/       ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_пр$/       ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_пр$/             ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_пр$/             ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_пр$/           ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_пр$/               ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_пр$/               ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_пр$/         ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_пр$/               ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_род$/         ){  pq2_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_род$/         ){  pq2_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_род$/             ){  pq2_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_род$/             ){  pq2_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_род$/             ){  pq2_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_род$/             ){  pq2_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_род$/       ){  pq2_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_род$/       ){  pq2_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_род$/             ){  pq2_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_род$/             ){  pq2_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_род$/        ){  pqn_ne_vz_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_род$/        ){  pqn_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_род$/            ){  pqn_ne_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_род$/            ){  pqn_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_род$/            ){  pqn_pe_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_род$/            ){  pqn_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_род$/      ){  pqn_pe_sd_na_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_род$/      ){  pqn_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_род$/            ){  pqn_pn_na_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_род$/            ){  pqn_pn_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_род$/          ){  pqs_ne_vz_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_род$/              ){  pqs_ne_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_род$/              ){  pqs_pe_pa_ed_ze_dr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_род$/        ){  pqs_pe_sd_pa_ed_ze_dr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_род$/              ){  pqs_pn_pa_ed_ze_dr     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_им$/          ){  pq2_ne_vz_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_им$/          ){  pq2_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_им$/              ){  pq2_ne_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_им$/              ){  pq2_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_им$/              ){  pq2_pe_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_им$/              ){  pq2_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_им$/        ){  pq2_pe_sd_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_им$/        ){  pq2_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_им$/              ){  pq2_pn_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_им$/              ){  pq2_pn_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_им$/         ){  pqn_ne_vz_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_им$/         ){  pqn_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_им$/             ){  pqn_ne_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_им$/             ){  pqn_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_им$/             ){  pqn_pe_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_им$/             ){  pqn_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_им$/       ){  pqn_pe_sd_na_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_им$/       ){  pqn_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_им$/             ){  pqn_pn_na_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_им$/             ){  pqn_pn_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_им$/           ){  pqs_ne_vz_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_им$/               ){  pqs_ne_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_им$/               ){  pqs_pe_pa_ed_ze_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_им$/         ){  pqs_pe_sd_pa_ed_ze_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_им$/               ){  pqs_pn_pa_ed_ze_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_жен_вин$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_жен_вин$/         ){  pq2_ne_vz_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_жен_вин$/         ){  pq2_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_жен_вин$/             ){  pq2_ne_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_жен_вин$/             ){  pq2_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_жен_вин$/             ){  pq2_pe_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_жен_вин$/             ){  pq2_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_жен_вин$/       ){  pq2_pe_sd_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_жен_вин$/       ){  pq2_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_жен_вин$/             ){  pq2_pn_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_жен_вин$/             ){  pq2_pn_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_жен_вин$/        ){  pqn_ne_vz_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_жен_вин$/        ){  pqn_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_жен_вин$/            ){  pqn_ne_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_жен_вин$/            ){  pqn_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_жен_вин$/            ){  pqn_pe_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_жен_вин$/            ){  pqn_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_жен_вин$/      ){  pqn_pe_sd_na_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_жен_вин$/      ){  pqn_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_жен_вин$/            ){  pqn_pn_na_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_жен_вин$/            ){  pqn_pn_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_жен_вин$/          ){  pqs_ne_vz_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_жен_вин$/              ){  pqs_ne_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_жен_вин$/              ){  pqs_pe_pa_ed_ze_vi     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_жен_вин$/        ){  pqs_pe_sd_pa_ed_ze_vi  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_жен_вин$/              ){  pqs_pn_pa_ed_ze_vi     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]ю(ся)?$/             ){  pq_edze_tv        [$1]=$3; continue };
#       if ($2~ /_ед_жен_тв$/ && $1~ /[ео]й(ся)?$/             ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_дат$/                                 ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_пр$/                                  ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_род$/                                 ){  pq_edze_dr        [$1]=$3; continue };
#       if ($2~ /_ед_жен_им$/                                  ){  pq_edze_im        [$1]=$3; continue };
#       if ($2~ /_ед_жен_вин$/                                 ){  pq_edze_vi        [$1]=$3; continue };
      if($2~ /_ед_муж_/ ){
       if ($2~ /_ед_муж_вин_неод$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_вин_неод$/    ){  pq2_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_вин_неод$/    ){  pq2_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_вин_неод$/        ){  pq2_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_вин_неод$/        ){  pq2_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_вин_неод$/        ){  pq2_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_вин_неод$/        ){  pq2_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_вин_неод$/  ){  pq2_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_вин_неод$/  ){  pq2_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_вин_неод$/        ){  pq2_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_вин_неод$/        ){  pq2_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_вин_неод$/   ){  pqn_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_вин_неод$/   ){  pqn_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_вин_неод$/       ){  pqn_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_вин_неод$/       ){  pqn_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_вин_неод$/       ){  pqn_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_вин_неод$/       ){  pqn_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_вин_неод$/ ){  pqn_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_вин_неод$/ ){  pqn_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_вин_неод$/       ){  pqn_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_вин_неод$/       ){  pqn_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_вин_неод$/     ){  pqs_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_вин_неод$/         ){  pqs_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_вин_неод$/         ){  pqs_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_вин_неод$/   ){  pqs_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_вин_неод$/         ){  pqs_pn_pa_ed_mu_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_вин_одуш$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_вин_одуш$/    ){  pq2_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_вин_одуш$/    ){  pq2_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_вин_одуш$/        ){  pq2_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_вин_одуш$/        ){  pq2_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_вин_одуш$/        ){  pq2_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_вин_одуш$/        ){  pq2_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_вин_одуш$/  ){  pq2_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_вин_одуш$/  ){  pq2_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_вин_одуш$/        ){  pq2_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_вин_одуш$/        ){  pq2_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_вин_одуш$/   ){  pqn_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_вин_одуш$/   ){  pqn_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_вин_одуш$/       ){  pqn_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_вин_одуш$/       ){  pqn_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_вин_одуш$/       ){  pqn_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_вин_одуш$/       ){  pqn_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_вин_одуш$/ ){  pqn_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_вин_одуш$/ ){  pqn_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_вин_одуш$/       ){  pqn_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_вин_одуш$/       ){  pqn_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_вин_одуш$/     ){  pqs_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_вин_одуш$/         ){  pqs_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_вин_одуш$/         ){  pqs_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_вин_одуш$/   ){  pqs_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_вин_одуш$/         ){  pqs_pn_pa_ed_mu_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_дат$/         ){  pq2_ne_vz_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_дат$/         ){  pq2_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_дат$/             ){  pq2_ne_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_дат$/             ){  pq2_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_дат$/             ){  pq2_pe_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_дат$/             ){  pq2_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_дат$/       ){  pq2_pe_sd_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_дат$/       ){  pq2_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_дат$/             ){  pq2_pn_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_дат$/             ){  pq2_pn_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_дат$/        ){  pqn_ne_vz_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_дат$/        ){  pqn_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_дат$/            ){  pqn_ne_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_дат$/            ){  pqn_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_дат$/            ){  pqn_pe_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_дат$/            ){  pqn_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_дат$/      ){  pqn_pe_sd_na_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_дат$/      ){  pqn_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_дат$/            ){  pqn_pn_na_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_дат$/            ){  pqn_pn_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_дат$/          ){  pqs_ne_vz_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_дат$/              ){  pqs_ne_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_дат$/              ){  pqs_pe_pa_ed_mu_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_дат$/        ){  pqs_pe_sd_pa_ed_mu_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_дат$/              ){  pqs_pn_pa_ed_mu_da     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_им$/          ){  pq2_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_им$/          ){  pq2_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_им$/              ){  pq2_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_им$/              ){  pq2_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_им$/              ){  pq2_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_им$/              ){  pq2_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_им$/        ){  pq2_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_им$/        ){  pq2_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_им$/              ){  pq2_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_им$/              ){  pq2_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_им$/         ){  pqn_ne_vz_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_им$/         ){  pqn_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_им$/             ){  pqn_ne_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_им$/             ){  pqn_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_им$/             ){  pqn_pe_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_им$/             ){  pqn_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_им$/       ){  pqn_pe_sd_na_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_им$/       ){  pqn_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_им$/             ){  pqn_pn_na_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_им$/             ){  pqn_pn_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_им$/           ){  pqs_ne_vz_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_им$/               ){  pqs_ne_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_им$/               ){  pqs_pe_pa_ed_mu_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_им$/         ){  pqs_pe_sd_pa_ed_mu_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_им$/               ){  pqs_pn_pa_ed_mu_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_пр$/          ){  pq2_ne_vz_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_пр$/          ){  pq2_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_пр$/              ){  pq2_ne_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_пр$/              ){  pq2_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_пр$/              ){  pq2_pe_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_пр$/              ){  pq2_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_пр$/        ){  pq2_pe_sd_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_пр$/        ){  pq2_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_пр$/              ){  pq2_pn_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_пр$/              ){  pq2_pn_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_пр$/         ){  pqn_ne_vz_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_пр$/         ){  pqn_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_пр$/             ){  pqn_ne_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_пр$/             ){  pqn_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_пр$/             ){  pqn_pe_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_пр$/             ){  pqn_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_пр$/       ){  pqn_pe_sd_na_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_пр$/       ){  pqn_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_пр$/             ){  pqn_pn_na_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_пр$/             ){  pqn_pn_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_пр$/           ){  pqs_ne_vz_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_пр$/               ){  pqs_ne_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_пр$/               ){  pqs_pe_pa_ed_mu_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_пр$/         ){  pqs_pe_sd_pa_ed_mu_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_пр$/               ){  pqs_pn_pa_ed_mu_pr     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_род$/         ){  pq2_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_род$/         ){  pq2_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_род$/             ){  pq2_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_род$/             ){  pq2_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_род$/             ){  pq2_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_род$/             ){  pq2_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_род$/       ){  pq2_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_род$/       ){  pq2_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_род$/             ){  pq2_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_род$/             ){  pq2_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_род$/        ){  pqn_ne_vz_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_род$/        ){  pqn_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_род$/            ){  pqn_ne_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_род$/            ){  pqn_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_род$/            ){  pqn_pe_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_род$/            ){  pqn_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_род$/      ){  pqn_pe_sd_na_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_род$/      ){  pqn_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_род$/            ){  pqn_pn_na_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_род$/            ){  pqn_pn_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_род$/          ){  pqs_ne_vz_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_род$/              ){  pqs_ne_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_род$/              ){  pqs_pe_pa_ed_mu_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_род$/        ){  pqs_pe_sd_pa_ed_mu_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_род$/              ){  pqs_pn_pa_ed_mu_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_муж_тв$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_муж_тв$/          ){  pq2_ne_vz_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_муж_тв$/          ){  pq2_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_муж_тв$/              ){  pq2_ne_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_муж_тв$/              ){  pq2_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_муж_тв$/              ){  pq2_pe_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_муж_тв$/              ){  pq2_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_муж_тв$/        ){  pq2_pe_sd_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_муж_тв$/        ){  pq2_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_муж_тв$/              ){  pq2_pn_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_муж_тв$/              ){  pq2_pn_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_муж_тв$/         ){  pqn_ne_vz_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_муж_тв$/         ){  pqn_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_муж_тв$/             ){  pqn_ne_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_муж_тв$/             ){  pqn_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_муж_тв$/             ){  pqn_pe_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_муж_тв$/             ){  pqn_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_муж_тв$/       ){  pqn_pe_sd_na_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_муж_тв$/       ){  pqn_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_муж_тв$/             ){  pqn_pn_na_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_муж_тв$/             ){  pqn_pn_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_муж_тв$/           ){  pqs_ne_vz_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_муж_тв$/               ){  pqs_ne_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_муж_тв$/               ){  pqs_pe_pa_ed_mu_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_муж_тв$/         ){  pqs_pe_sd_pa_ed_mu_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_муж_тв$/               ){  pqs_pn_pa_ed_mu_tv     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_муж_вин_неод$/                            ){  pq_edmu_im        [$1]=$3; continue };
#       if ($2~ /_ед_муж_вин_одуш$/                            ){  pq_edmu_ro        [$1]=$3; continue };
#       if ($2~ /_ед_муж_им$/                                  ){  pq_edmu_im        [$1]=$3; continue };
#       if ($2~ /_ед_муж_пр$/                                  ){  pq_edmu_pr        [$1]=$3; continue };
#       if ($2~ /_ед_муж_род$/                                 ){  pq_edmu_ro        [$1]=$3; continue };
#       if ($2~ /_ед_муж_тв$/                                  ){  pq_edmu_tv        [$1]=$3; continue };
#       if ($2~ /_ед_муж_дат$/                                 ){  pq_edmu_da        [$1]=$3; continue };
      if($2~ /_ед_ср_/ ){
       if ($2~ /_ед_ср_вин$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_вин$/          ){  pq2_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_вин$/          ){  pq2_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_вин$/              ){  pq2_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_вин$/              ){  pq2_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_вин$/              ){  pq2_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_вин$/              ){  pq2_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_вин$/        ){  pq2_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_вин$/        ){  pq2_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_вин$/              ){  pq2_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_вин$/              ){  pq2_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_вин$/         ){  pqn_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_вин$/         ){  pqn_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_вин$/             ){  pqn_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_вин$/             ){  pqn_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_вин$/             ){  pqn_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_вин$/             ){  pqn_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_вин$/       ){  pqn_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_вин$/       ){  pqn_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_вин$/             ){  pqn_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_вин$/             ){  pqn_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_вин$/           ){  pqs_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_вин$/               ){  pqs_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_вин$/               ){  pqs_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_вин$/         ){  pqs_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_вин$/               ){  pqs_pn_pa_ed_sr_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_дат$/          ){  pq2_ne_vz_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_дат$/          ){  pq2_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_дат$/              ){  pq2_ne_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_дат$/              ){  pq2_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_дат$/              ){  pq2_pe_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_дат$/              ){  pq2_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_дат$/        ){  pq2_pe_sd_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_дат$/        ){  pq2_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_дат$/              ){  pq2_pn_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_дат$/              ){  pq2_pn_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_дат$/         ){  pqn_ne_vz_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_дат$/         ){  pqn_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_дат$/             ){  pqn_ne_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_дат$/             ){  pqn_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_дат$/             ){  pqn_pe_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_дат$/             ){  pqn_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_дат$/       ){  pqn_pe_sd_na_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_дат$/       ){  pqn_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_дат$/             ){  pqn_pn_na_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_дат$/             ){  pqn_pn_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_дат$/           ){  pqs_ne_vz_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_дат$/               ){  pqs_ne_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_дат$/               ){  pqs_pe_pa_ed_sr_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_дат$/         ){  pqs_pe_sd_pa_ed_sr_da  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_дат$/               ){  pqs_pn_pa_ed_sr_da     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_им$/           ){  pq2_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_им$/           ){  pq2_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_им$/               ){  pq2_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_им$/               ){  pq2_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_им$/               ){  pq2_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_им$/               ){  pq2_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_им$/         ){  pq2_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_им$/         ){  pq2_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_им$/               ){  pq2_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_им$/               ){  pq2_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_им$/          ){  pqn_ne_vz_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_им$/          ){  pqn_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_им$/              ){  pqn_ne_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_им$/              ){  pqn_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_им$/              ){  pqn_pe_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_им$/              ){  pqn_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_им$/        ){  pqn_pe_sd_na_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_им$/        ){  pqn_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_им$/              ){  pqn_pn_na_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_им$/              ){  pqn_pn_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_им$/            ){  pqs_ne_vz_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_им$/                ){  pqs_ne_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_им$/                ){  pqs_pe_pa_ed_sr_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_им$/          ){  pqs_pe_sd_pa_ed_sr_im  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_им$/                ){  pqs_pn_pa_ed_sr_im     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_пр$/           ){  pq2_ne_vz_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_пр$/           ){  pq2_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_пр$/               ){  pq2_ne_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_пр$/               ){  pq2_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_пр$/               ){  pq2_pe_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_пр$/               ){  pq2_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_пр$/         ){  pq2_pe_sd_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_пр$/         ){  pq2_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_пр$/               ){  pq2_pn_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_пр$/               ){  pq2_pn_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_пр$/          ){  pqn_ne_vz_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_пр$/          ){  pqn_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_пр$/              ){  pqn_ne_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_пр$/              ){  pqn_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_пр$/              ){  pqn_pe_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_пр$/              ){  pqn_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_пр$/        ){  pqn_pe_sd_na_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_пр$/        ){  pqn_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_пр$/              ){  pqn_pn_na_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_пр$/              ){  pqn_pn_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_пр$/            ){  pqs_ne_vz_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_пр$/                ){  pqs_ne_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_пр$/                ){  pqs_pe_pa_ed_sr_pr     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_пр$/          ){  pqs_pe_sd_pa_ed_sr_pr  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_пр$/                ){  pqs_pn_pa_ed_sr_pr     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_род$/          ){  pq2_ne_vz_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_род$/          ){  pq2_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_род$/              ){  pq2_ne_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_род$/              ){  pq2_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_род$/              ){  pq2_pe_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_род$/              ){  pq2_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_род$/        ){  pq2_pe_sd_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_род$/        ){  pq2_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_род$/              ){  pq2_pn_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_род$/              ){  pq2_pn_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_род$/         ){  pqn_ne_vz_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_род$/         ){  pqn_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_род$/             ){  pqn_ne_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_род$/             ){  pqn_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_род$/             ){  pqn_pe_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_род$/             ){  pqn_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_род$/       ){  pqn_pe_sd_na_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_род$/       ){  pqn_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_род$/             ){  pqn_pn_na_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_род$/             ){  pqn_pn_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_род$/           ){  pqs_ne_vz_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_род$/               ){  pqs_ne_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_род$/               ){  pqs_pe_pa_ed_sr_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_род$/         ){  pqs_pe_sd_pa_ed_sr_ro  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_род$/               ){  pqs_pn_pa_ed_sr_ro     [$1]=$3; continue };
       };
       if ($2~ /_ед_ср_тв$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_ед_ср_тв$/           ){  pq2_ne_vz_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_ед_ср_тв$/           ){  pq2_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_ед_ср_тв$/               ){  pq2_ne_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_ед_ср_тв$/               ){  pq2_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_ед_ср_тв$/               ){  pq2_pe_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_ед_ср_тв$/               ){  pq2_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_ед_ср_тв$/         ){  pq2_pe_sd_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_ед_ср_тв$/         ){  pq2_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_ед_ср_тв$/               ){  pq2_pn_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_ед_ср_тв$/               ){  pq2_pn_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_ед_ср_тв$/          ){  pqn_ne_vz_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_ед_ср_тв$/          ){  pqn_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_ед_ср_тв$/              ){  pqn_ne_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_ед_ср_тв$/              ){  pqn_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_ед_ср_тв$/              ){  pqn_pe_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_ед_ср_тв$/              ){  pqn_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_ед_ср_тв$/        ){  pqn_pe_sd_na_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_ед_ср_тв$/        ){  pqn_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_ед_ср_тв$/              ){  pqn_pn_na_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_ед_ср_тв$/              ){  pqn_pn_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_ед_ср_тв$/            ){  pqs_ne_vz_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_ед_ср_тв$/                ){  pqs_ne_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_ед_ср_тв$/                ){  pqs_pe_pa_ed_sr_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_ед_ср_тв$/          ){  pqs_pe_sd_pa_ed_sr_tv  [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_ед_ср_тв$/                ){  pqs_pn_pa_ed_sr_tv     [$1]=$3; continue };
       };
      };
#       if ($2~ /_ед_ср_вин$/                                  ){  pq_edsr_im        [$1]=$3; continue };
#       if ($2~ /_ед_ср_дат$/                                  ){  pq_edsr_da        [$1]=$3; continue };
#       if ($2~ /_ед_ср_им$/                                   ){  pq_edsr_im        [$1]=$3; continue };
#       if ($2~ /_ед_ср_пр$/                                   ){  pq_edsr_pr        [$1]=$3; continue };
#       if ($2~ /_ед_ср_род$/                                  ){  pq_edsr_ro        [$1]=$3; continue };
#       if ($2~ /_ед_ср_тв$/                                   ){  pq_edsr_tv        [$1]=$3; continue };
      if($2~ /_мн_/ ){
       if ($2~ /_мн_вин_неод$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_вин_неод$/        ){  pq2_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_вин_неод$/        ){  pq2_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_вин_неод$/            ){  pq2_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_вин_неод$/            ){  pq2_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_вин_неод$/            ){  pq2_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_вин_неод$/            ){  pq2_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_вин_неод$/      ){  pq2_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_вин_неод$/      ){  pq2_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_вин_неод$/            ){  pq2_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_вин_неод$/            ){  pq2_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_вин_неод$/       ){  pqn_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_вин_неод$/       ){  pqn_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_вин_неод$/           ){  pqn_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_вин_неод$/           ){  pqn_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_вин_неод$/           ){  pqn_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_вин_неод$/           ){  pqn_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_вин_неод$/     ){  pqn_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_вин_неод$/     ){  pqn_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_вин_неод$/           ){  pqn_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_вин_неод$/           ){  pqn_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_вин_неод$/         ){  pqs_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_вин_неод$/             ){  pqs_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_вин_неод$/             ){  pqs_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_вин_неод$/       ){  pqs_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_вин_неод$/             ){  pqs_pn_pa_mn_im        [$1]=$3; continue };
       };
       if ($2~ /_мн_вин_одуш$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_вин_одуш$/        ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_вин_одуш$/        ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_вин_одуш$/            ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_вин_одуш$/            ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_вин_одуш$/            ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_вин_одуш$/            ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_вин_одуш$/      ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_вин_одуш$/      ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_вин_одуш$/            ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_вин_одуш$/            ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_вин_одуш$/       ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_вин_одуш$/       ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_вин_одуш$/           ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_вин_одуш$/           ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_вин_одуш$/           ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_вин_одуш$/           ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_вин_одуш$/     ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_вин_одуш$/     ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_вин_одуш$/           ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_вин_одуш$/           ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_вин_одуш$/         ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_вин_одуш$/             ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_вин_одуш$/             ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_вин_одуш$/       ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_вин_одуш$/             ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };
       if ($2~ /_мн_дат$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_дат$/             ){  pq2_ne_vz_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_дат$/             ){  pq2_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_дат$/                 ){  pq2_ne_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_дат$/                 ){  pq2_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_дат$/                 ){  pq2_pe_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_дат$/                 ){  pq2_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_дат$/           ){  pq2_pe_sd_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_дат$/           ){  pq2_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_дат$/                 ){  pq2_pn_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_дат$/                 ){  pq2_pn_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_дат$/            ){  pqn_ne_vz_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_дат$/            ){  pqn_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_дат$/                ){  pqn_ne_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_дат$/                ){  pqn_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_дат$/                ){  pqn_pe_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_дат$/                ){  pqn_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_дат$/          ){  pqn_pe_sd_na_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_дат$/          ){  pqn_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_дат$/                ){  pqn_pn_na_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_дат$/                ){  pqn_pn_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_дат$/              ){  pqs_ne_vz_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_дат$/                  ){  pqs_ne_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_дат$/                  ){  pqs_pe_pa_mn_da        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_дат$/            ){  pqs_pe_sd_pa_mn_da     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_дат$/                  ){  pqs_pn_pa_mn_da        [$1]=$3; continue };
       };
       if ($2~ /_мн_им$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_им$/              ){  pq2_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_им$/              ){  pq2_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_им$/                  ){  pq2_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_им$/                  ){  pq2_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_им$/                  ){  pq2_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_им$/                  ){  pq2_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_им$/            ){  pq2_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_им$/            ){  pq2_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_им$/                  ){  pq2_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_им$/                  ){  pq2_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_им$/             ){  pqn_ne_vz_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_им$/             ){  pqn_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_им$/                 ){  pqn_ne_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_им$/                 ){  pqn_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_им$/                 ){  pqn_pe_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_им$/                 ){  pqn_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_им$/           ){  pqn_pe_sd_na_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_им$/           ){  pqn_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_им$/                 ){  pqn_pn_na_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_им$/                 ){  pqn_pn_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_им$/               ){  pqs_ne_vz_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_им$/                   ){  pqs_ne_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_им$/                   ){  pqs_pe_pa_mn_im        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_им$/             ){  pqs_pe_sd_pa_mn_im     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_им$/                   ){  pqs_pn_pa_mn_im        [$1]=$3; continue };
       };
       if ($2~ /_мн_пр$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_пр$/              ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_пр$/              ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_пр$/                  ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_пр$/                  ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_пр$/                  ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_пр$/                  ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_пр$/            ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_пр$/            ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_пр$/                  ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_пр$/                  ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_пр$/             ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_пр$/             ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_пр$/                 ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_пр$/                 ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_пр$/                 ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_пр$/                 ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_пр$/           ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_пр$/           ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_пр$/                 ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_пр$/                 ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_пр$/               ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_пр$/                   ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_пр$/                   ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_пр$/             ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_пр$/                   ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };
       if ($2~ /_мн_род$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_род$/             ){  pq2_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_род$/             ){  pq2_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_род$/                 ){  pq2_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_род$/                 ){  pq2_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_род$/                 ){  pq2_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_род$/                 ){  pq2_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_род$/           ){  pq2_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_род$/           ){  pq2_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_род$/                 ){  pq2_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_род$/                 ){  pq2_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_род$/            ){  pqn_ne_vz_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_род$/            ){  pqn_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_род$/                ){  pqn_ne_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_род$/                ){  pqn_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_род$/                ){  pqn_pe_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_род$/                ){  pqn_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_род$/          ){  pqn_pe_sd_na_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_род$/          ){  pqn_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_род$/                ){  pqn_pn_na_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_род$/                ){  pqn_pn_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_род$/              ){  pqs_ne_vz_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_род$/                  ){  pqs_ne_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_род$/                  ){  pqs_pe_pa_mn_ro        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_род$/            ){  pqs_pe_sd_pa_mn_ro     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_род$/                  ){  pqs_pn_pa_mn_ro        [$1]=$3; continue };
       };
       if ($2~ /_мн_тв$/ ){
        if ($2~ /^прч_2вид_непер_воз_наст_мн_тв$/              ){  pq2_ne_vz_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_воз_прош_мн_тв$/              ){  pq2_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_наст_мн_тв$/                  ){  pq2_ne_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_непер_прош_мн_тв$/                  ){  pq2_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_наст_мн_тв$/                  ){  pq2_pe_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_прош_мн_тв$/                  ){  pq2_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_наст_мн_тв$/            ){  pq2_pe_sd_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перех_страд_прош_мн_тв$/            ){  pq2_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_наст_мн_тв$/                  ){  pq2_pn_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_2вид_перне_прош_мн_тв$/                  ){  pq2_pn_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_наст_мн_тв$/             ){  pqn_ne_vz_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_воз_прош_мн_тв$/             ){  pqn_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_наст_мн_тв$/                 ){  pqn_ne_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_непер_прош_мн_тв$/                 ){  pqn_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_наст_мн_тв$/                 ){  pqn_pe_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_прош_мн_тв$/                 ){  pqn_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_наст_мн_тв$/           ){  pqn_pe_sd_na_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перех_страд_прош_мн_тв$/           ){  pqn_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_наст_мн_тв$/                 ){  pqn_pn_na_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_несов_перне_прош_мн_тв$/                 ){  pqn_pn_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_воз_прош_мн_тв$/               ){  pqs_ne_vz_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_непер_прош_мн_тв$/                   ){  pqs_ne_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_прош_мн_тв$/                   ){  pqs_pe_pa_mn_tv        [$1]=$3; continue };
        if ($2~ /^прч_сов_перех_страд_прош_мн_тв$/             ){  pqs_pe_sd_pa_mn_tv     [$1]=$3; continue };
        if ($2~ /^прч_сов_перне_прош_мн_тв$/                   ){  pqs_pn_pa_mn_tv        [$1]=$3; continue };
       };
      };
#       if ($2~ /_мн_вин_неод$/                                ){  pq_mn_im          [$1]=$3; continue };
#       if ($2~ /_мн_вин_одуш$/                                ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_дат$/                                     ){  pq_mn_da          [$1]=$3; continue };
#       if ($2~ /_мн_им$/                                      ){  pq_mn_im          [$1]=$3; continue };
#       if ($2~ /_мн_пр$/                                      ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_род$/                                     ){  pq_mn_ro          [$1]=$3; continue };
#       if ($2~ /_мн_тв$/                                      ){  pq_mn_tv          [$1]=$3; continue };
      if($2~  /^прч_крат_/ ){
       if ($2~ /_ед_жен$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_жен$/      ){  pq2_na_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_жен$/      ){  pq2_pa_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_жен$/     ){  pqn_na_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_жен$/     ){  pqn_pa_kred_ze         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_жен$/       ){  pqs_pa_kred_ze         [$1]=$3; continue };
       };
       if ($2~ /_ед_муж$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_муж$/      ){  pq2_na_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_муж$/      ){  pq2_pa_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_муж$/     ){  pqn_na_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_муж$/     ){  pqn_pa_kred_mu         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_муж$/       ){  pqs_pa_kred_mu         [$1]=$3; continue };
       };
       if ($2~ /_ед_ср$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_ед_ср$/       ){  pq2_na_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_ед_ср$/       ){  pq2_pa_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_ед_ср$/      ){  pqn_na_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_ед_ср$/      ){  pqn_pa_kred_sr         [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_ед_ср$/        ){  pqs_pa_kred_sr         [$1]=$3; continue };
       };
       if ($2~ /_мн$/ ){
        if ($2~ /^прч_крат_2вид_перех_страд_наст_мн$/          ){  pq2_na_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_2вид_перех_страд_прош_мн$/          ){  pq2_pa_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_наст_мн$/         ){  pqn_na_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_несов_перех_страд_прош_мн$/         ){  pqn_pa_krmn            [$1]=$3; continue };
        if ($2~ /^прч_крат_сов_перех_страд_прош_мн$/           ){  pqs_pa_krmn            [$1]=$3; continue };
       };
      };
     }; # чтение prq-dic
#       if ($2~ /_ед_жен$/                                     ){  pq_kred_ze        [$1]=$3; continue };
#       if ($2~ /_ед_муж$/                                     ){  pq_kred_mu        [$1]=$3; continue };
#       if ($2~ /_ед_ср$/                                      ){  pq_kred_sr        [$1]=$3; continue };
#       if ($2~ /_мн$/                                         ){  pq_krmn           [$1]=$3; continue };
   close(cmd);
   cmd = "zcat " locdic "dic_prl.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($4== "NOP") { continue };
  #    BF[$1] = "#" $3;

      if($2~  /^прл_ед_жен_/ ){
        if ($2~ /^прл_ед_жен_тв$/ && $1~ /[ео]ю$/              ){  pl_edze_tv        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_тв$/ && $1~ /[ео]й$/              ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_вин$/                             ){  pl_edze_vi        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_дат$/                             ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_им$/                              ){  pl_edze_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_пр$/                              ){  pl_edze_dr        [$1]=$3; continue };
        if ($2~ /^прл_ед_жен_род$/                             ){  pl_edze_dr        [$1]=$3; continue };
      };
      if($2~  /^прл_ед_муж_/ ){
        if ($2~ /^прл_ед_муж_вин_неод$/                        ){  pl_edmu_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_вин_одуш$/                        ){  pl_edmu_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_дат$/                             ){  pl_edmu_da        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_им$/                              ){  pl_edmu_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_пр$/                              ){  pl_edmu_pr        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_род$/                             ){  pl_edmu_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_муж_тв$/                              ){  pl_edmu_tv        [$1]=$3; continue };
      };
      if($2~  /^прл_ед_ср_/ ){
        if ($2~ /^прл_ед_ср_вин$/                              ){  pl_edsr_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_дат$/                              ){  pl_edsr_da        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_им$/                               ){  pl_edsr_im        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_пр$/                               ){  pl_edsr_pr        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_род$/                              ){  pl_edsr_ro        [$1]=$3; continue };
        if ($2~ /^прл_ед_ср_тв$/                               ){  pl_edsr_tv        [$1]=$3; continue };
      };
      if($2~  /^прл_мн_/ ){
        if ($2~ /^прл_мн_вин_неод$/                            ){  pl_mn_im          [$1]=$3; continue };
        if ($2~ /^прл_мн_вин_одуш$/                            ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_дат$/                                 ){  pl_mn_da          [$1]=$3; continue };
        if ($2~ /^прл_мн_им$/                                  ){  pl_mn_im          [$1]=$3; continue };
        if ($2~ /^прл_мн_пр$/                                  ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_род$/                                 ){  pl_mn_ro          [$1]=$3; continue };
        if ($2~ /^прл_мн_тв$/                                  ){  pl_mn_tv          [$1]=$3; continue };
      };
        if ($2~ /^прл_сравн$/                                  ){  pl_srv            [$1]=$3; continue };
      if($2~  /^прл_крат_/ ){
        if ($2~ /^прл_крат_ед_муж$/                            ){  pl_kred_mu        [$1]=$3; continue };
        if ($2~ /^прл_крат_ед_жен$/                            ){  pl_kred_ze        [$1]=$3; continue };
        if ($2~ /^прл_крат_ед_ср$/                             ){  pl_kred_sr        [$1]=$3; continue };
        if ($2~ /^прл_крат_мн$/                                ){  pl_krmn           [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_жен_/ ){
        if ($2~ /^прл_прев_ед_жен_тв$/ &&$1~/[ео]ю$/           ){  pl_pv_edze_tv     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_тв$/ &&$1~/[ео]й$/           ){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_вин$/                        ){  pl_pv_edze_vi     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_дат$/                        ){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_им$/                         ){  pl_pv_edze_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_пр$/                         ){  pl_pv_edze_dr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_жен_род$/                        ){  pl_pv_edze_dr     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_муж_/ ){
        if ($2~ /^прл_прев_ед_муж_вин_неод$/                   ){  pl_pv_edmu_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_вин_одуш$/                   ){  pl_pv_edmu_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_дат$/                        ){  pl_pv_edmu_da     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_им$/                         ){  pl_pv_edmu_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_пр$/                         ){  pl_pv_edmu_pr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_род$/                        ){  pl_pv_edmu_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_муж_тв$/                         ){  pl_pv_edmu_tv     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_ед_ср_/ ){
        if ($2~ /^прл_прев_ед_ср_вин$/                         ){  pl_pv_edsr_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_дат$/                         ){  pl_pv_edsr_da     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_им$/                          ){  pl_pv_edsr_im     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_пр$/                          ){  pl_pv_edsr_pr     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_род$/                         ){  pl_pv_edsr_ro     [$1]=$3; continue };
        if ($2~ /^прл_прев_ед_ср_тв$/                          ){  pl_pv_edsr_tv     [$1]=$3; continue };
      };
      if($2~  /^прл_прев_мн_/ ){
        if ($2~ /^прл_прев_мн_вин_неод$/                       ){  pl_pv_mn_im       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_вин_одуш$/                       ){  pl_pv_mn_ro       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_дат$/                            ){  pl_pv_mn_da       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_им$/                             ){  pl_pv_mn_im       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_пр$/                             ){  pl_pv_mn_pr       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_род$/                            ){  pl_pv_mn_ro       [$1]=$3; continue };
        if ($2~ /^прл_прев_мн_тв$/                             ){  pl_pv_mn_tv       [$1]=$3; continue };
      };
        if ($2~ /^прл_неизм$/                                  ){  pl_neiz           [$1]=$3; continue };
#       if ($2~ /^прл_аффикс$/                                 ){  pl_affix          [$1]=$3; continue };
    }; # чтение prl-dic
   close(cmd);
   cmd = "zcat " locdic "dic_suw.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($4== "NOP") { continue };
  #    BF[$1] = "#" $3;

      if ($2~ /^сущ_неод_/ ) {
       if ($2~ /^сущ_неод_мн_/ ) {
        if ($2~ /^сущ_неод_мн_вин$/                            ){  swn_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_дат$/                            ){  swn_mn_da         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_им$/                             ){  swn_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_пр$/                             ){  swn_mn_pr         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_род$/                            ){  swn_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_тв$/                             ){  swn_mn_tv         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_нескл$/                          ){  swn_mn_ne         [$1]=$3; continue };
        if ($2~ /^сущ_неод_мн_счет$/                           ){  swn_mn_sq         [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_жен_/ ) {
        if ($2~ /^сущ_неод_ед_жен_тв$/                         ){  swn_edze_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_вин$/                        ){  swn_edze_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_дат$/                        ){  swn_edze_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_им$/                         ){  swn_edze_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_пр$/                         ){  swn_edze_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_род$/                        ){  swn_edze_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_нескл$/                      ){  swn_edze_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_жен_мест$/                       ){  swn_edze_me       [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_муж_/ ) {
        if ($2~ /^сущ_неод_ед_муж_вин$/                        ){  swn_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_дат$/                        ){  swn_edmu_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_им$/                         ){  swn_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_пр$/                         ){  swn_edmu_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_род$/                        ){  swn_edmu_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_тв$/                         ){  swn_edmu_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_нескл$/                      ){  swn_edmu_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_мест$/                       ){  swn_edmu_me       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_парт$/                       ){  swn_edmu_pt       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_муж_счет$/                       ){  swn_edmu_sq       [$1]=$3; continue };
       };
       if ($2~ /^сущ_неод_ед_ср_/ ) {
        if ($2~ /^сущ_неод_ед_ср_вин$/                         ){  swn_edsr_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_дат$/                         ){  swn_edsr_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_им$/                          ){  swn_edsr_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_пр$/                          ){  swn_edsr_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_род$/                         ){  swn_edsr_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_тв$/                          ){  swn_edsr_tv       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_ср_нескл$/                       ){  swn_edsr_ne       [$1]=$3; continue };
       };
        if ($2~ /^сущ_неод_ед_общ_вин$/                        ){  swn_edob_vi       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_дат$/                        ){  swn_edob_da       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_им$/                         ){  swn_edob_im       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_нескл$/                      ){  swn_edob_ne       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_пр$/                         ){  swn_edob_pr       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_род$/                        ){  swn_edob_ro       [$1]=$3; continue };
        if ($2~ /^сущ_неод_ед_общ_тв$/                         ){  swn_edob_tv       [$1]=$3; continue };
      };
      if ($2~ /^сущ_одуш_/ ) {
       if ($2~ /^сущ_одуш_мн_/ ) {
        if ($2~ /^сущ_одуш_мн_вин$/                            ){  swo_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_дат$/                            ){  swo_mn_da         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_им$/                             ){  swo_mn_im         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_пр$/                             ){  swo_mn_pr         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_род$/                            ){  swo_mn_ro         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_тв$/                             ){  swo_mn_tv         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_нескл$/                          ){  swo_mn_ne         [$1]=$3; continue };
        if ($2~ /^сущ_одуш_мн_счет$/                           ){  swo_mn_sq         [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_муж_/ ) {
        if ($2~ /^сущ_одуш_ед_муж_вин$/                        ){  swo_edmu_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_дат$/                        ){  swo_edmu_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_им$/                         ){  swo_edmu_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_пр$/                         ){  swo_edmu_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_род$/                        ){  swo_edmu_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_тв$/                         ){  swo_edmu_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_нескл$/                      ){  swo_edmu_ne       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_муж_зват$/                       ){  swo_edmu_zv       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_жен_/ ) {
        if ($2~ /^сущ_одуш_ед_жен_тв$/                         ){  swo_edze_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_вин$/                        ){  swo_edze_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_дат$/                        ){  swo_edze_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_им$/                         ){  swo_edze_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_пр$/                         ){  swo_edze_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_род$/                        ){  swo_edze_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_нескл$/                      ){  swo_edze_ne       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_жен_зват$/                       ){  swo_edze_zv       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_общ_/ ) {
        if ($2~ /^сущ_одуш_ед_общ_тв$/                         ){  swo_edob_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_вин$/                        ){  swo_edob_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_дат$/                        ){  swo_edob_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_им$/                         ){  swo_edob_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_пр$/                         ){  swo_edob_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_род$/                        ){  swo_edob_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_нескл$/                      ){  swo_edob_ne       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_общ_зват$/                       ){  swo_edob_zv       [$1]=$3; continue };
       };
       if ($2~ /^сущ_одуш_ед_ср_/ ) {
        if ($2~ /^сущ_одуш_ед_ср_вин$/                         ){  swo_edsr_vi       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_дат$/                         ){  swo_edsr_da       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_им$/                          ){  swo_edsr_im       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_пр$/                          ){  swo_edsr_pr       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_род$/                         ){  swo_edsr_ro       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_тв$/                          ){  swo_edsr_tv       [$1]=$3; continue };
        if ($2~ /^сущ_одуш_ед_ср_нескл$/                       ){  swo_edsr_ne       [$1]=$3; continue };
       };
      };
      if ($2~ /^сущ_мн_/ ) {
        if ($2~ /^сущ_мн_дат$/                                 ){  sw_mn_da          [$1]=$3; continue };
        if ($2~ /^сущ_мн_им$/                                  ){  sw_mn_im          [$1]=$3; continue };
        if ($2~ /^сущ_мн_пр$/                                  ){  sw_mn_pr          [$1]=$3; continue };
        if ($2~ /^сущ_мн_род$/                                 ){  sw_mn_ro          [$1]=$3; continue };
        if ($2~ /^сущ_мн_тв$/                                  ){  sw_mn_tv          [$1]=$3; continue };
        if ($2~ /^сущ_мн_вин$/                                 ){  sw_mn_vi          [$1]=$3; continue };
        if ($2~ /^сущ_мн_нескл$/                               ){  sw_mn_ne          [$1]=$3; continue };
      };
      if ($2~ /^сущ_ед_жен_/ ) {
        if ($2~ /^сущ_ед_жен_тв$/                              ){  sw_edze_tv        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_вин$/                             ){  sw_edze_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_дат$/                             ){  sw_edze_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_им$/                              ){  sw_edze_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_пр$/                              ){  sw_edze_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_жен_род$/                             ){  sw_edze_ro        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_муж_/ ) {
        if ($2~ /^сущ_ед_муж_дат$/                             ){  sw_edmu_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_им$/                              ){  sw_edmu_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_пр$/                              ){  sw_edmu_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_род$/                             ){  sw_edmu_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_тв$/                              ){  sw_edmu_tv        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_вин$/                             ){  sw_edmu_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_муж_нескл$/                           ){  sw_edmu_ne        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_общ_/ ) {
        if ($2~ /^сущ_ед_общ_нескл$/                           ){  sw_edob_ne        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_вин$/                             ){  sw_edob_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_дат$/                             ){  sw_edob_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_им$/                              ){  sw_edob_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_пр$/                              ){  sw_edob_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_род$/                             ){  sw_edob_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_общ_тв$/                              ){  sw_edob_tv        [$1]=$3; continue };
       };
       if ($2~ /^сущ_ед_ср_/ ) {
        if ($2~ /^сущ_ед_ср_вин$/                              ){  sw_edsr_vi        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_дат$/                              ){  sw_edsr_da        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_им$/                               ){  sw_edsr_im        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_пр$/                               ){  sw_edsr_pr        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_род$/                              ){  sw_edsr_ro        [$1]=$3; continue };
        if ($2~ /^сущ_ед_ср_тв$/                               ){  sw_edsr_tv        [$1]=$3; continue };
      };
    }; # чтение suw-dic
   close(cmd);
   cmd = "zcat " locdic "dic_gl.gz";
   while ((cmd|getline) > 0) {

      if ($1~  "-"  ) { dichyph[$1] };
      if ($4== "NOP") { continue };
  #    BF[$1] = "#" $3;

         # md_gl для глаголов с признаками модальности
         if ($2 ~ /_прош_ед_ср$/                ) {split($3,itmz,"#"); for (j in itmz) { if (itmz[j] && itmz[j] in md_gl) { md_bz[$1]=$3 };};};
         if ($2 ~ /_ед/ && $2 !~ /_прош_ед_ср$/ ) {split($3,itmz,"#"); for (j in itmz) { if (itmz[j] && itmz[j] in md_gl) { md_ed[$1]=$3 };};};
         if ($2 ~ /_мн/                         ) {split($3,itmz,"#"); for (j in itmz) { if (itmz[j] && itmz[j] in md_gl) { md_mn[$1]=$3 };};};
         if ($2 ~ /^дееп_/                      ) {split($3,itmz,"#"); for (j in itmz) { if (itmz[j] && itmz[j] in md_gl) { md_dp[$1]=$3 };};};

      if($2~  /^гл_несов_непер_/ ){

        if ($2~ /^гл_несов_непер_воз_инф$/                     ){  gn_vz_ne_in       [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_воз_наст_/ ) {
        if ($2~ /^гл_несов_непер_воз_наст_ед_1е$/              ){  gn_vz_nena_e1     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_ед_2е$/              ){  gn_vz_nena_e2     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_ед_3е$/              ){  gn_vz_nena_e3     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_1е$/              ){  gn_vz_nena_m1     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_2е$/              ){  gn_vz_nena_m2     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_наст_мн_3е$/              ){  gn_vz_nena_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_воз_пов_ед$/                  ){  gn_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_пов_мн$/                  ){  gn_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_воз_прош_/ ) {
        if ($2~ /^гл_несов_непер_воз_прош_ед_жен$/             ){  gn_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_ед_муж$/             ){  gn_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_ед_ср$/              ){  gn_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_прош_мн$/                 ){  gn_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_инф$/                         ){  gn_nein           [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_наст_/ ) {
        if ($2~ /^гл_несов_непер_наст_ед_1е$/                  ){  gn_nena_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_ед_2е$/                  ){  gn_nena_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_ед_3е$/                  ){  gn_nena_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_1е$/                  ){  gn_nena_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_2е$/                  ){  gn_nena_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_наст_мн_3е$/                  ){  gn_nena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_пов_ед$/                      ){  gn_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_пов_мн$/                      ){  gn_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_непер_прош_/ ) {
        if ($2~ /^гл_несов_непер_прош_ед_жен$/                 ){  gn_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_ед_муж$/                 ){  gn_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_ед_ср$/                  ){  gn_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_прош_мн$/                     ){  gn_nepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_непер_инф_безл$/                    ){  gn_nein_bz        [$1]=$3; continue };
        if ($2~ /^гл_несов_непер_воз_инф_безл$/                ){  gn_vz_nein_bz     [$1]=$3; continue };

      };
      if($2~  /^гл_несов_перех_/ ){

        if ($2~ /^гл_несов_перех_инф$/                         ){  gn_pein           [$1]=$3; continue };

       if ($2~ /^гл_несов_перех_наст_/ ) {
        if ($2~ /^гл_несов_перех_наст_ед_1е$/                  ){  gn_pena_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_ед_2е$/                  ){  gn_pena_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_ед_3е$/                  ){  gn_pena_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_1е$/                  ){  gn_pena_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_2е$/                  ){  gn_pena_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_наст_мн_3е$/                  ){  gn_pena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перех_пов_ед$/                      ){  gn_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_пов_мн$/                      ){  gn_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_перех_прош_/ ) {
        if ($2~ /^гл_несов_перех_прош_ед_жен$/                 ){  gn_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_ед_муж$/                 ){  gn_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_ед_ср$/                  ){  gn_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_перех_прош_мн$/                     ){  gn_pepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перех_инф_безл$/                    ){  gn_pein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_несов_перне_/ ){

        if ($2~ /^гл_несов_перне_инф$/                         ){  gn_pnin           [$1]=$3; continue };

       if ($2~ /^гл_несов_перне_наст_/ ) {
        if ($2~ /^гл_несов_перне_наст_ед_1е$/                  ){  gn_pnna_e1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_ед_2е$/                  ){  gn_pnna_e2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_ед_3е$/                  ){  gn_pnna_e3        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_1е$/                  ){  gn_pnna_m1        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_2е$/                  ){  gn_pnna_m2        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_наст_мн_3е$/                  ){  gn_pnna_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_несов_перне_пов_ед$/                      ){  gn_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_пов_мн$/                      ){  gn_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_несов_перне_прош_/ ) {
        if ($2~ /^гл_несов_перне_прош_ед_жен$/                 ){  gn_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_ед_муж$/                 ){  gn_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_ед_ср$/                  ){  gn_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_несов_перне_прош_мн$/                     ){  gn_pnpa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_сов_непер_/ ){
       if ($2~ /^гл_сов_непер_буд_/ ) {
        if ($2~ /^гл_сов_непер_буд_ед_1е$/                     ){  gs_nebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_ед_2е$/                     ){  gs_nebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_ед_3е$/                     ){  gs_nebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_1е$/                     ){  gs_nebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_2е$/                     ){  gs_nebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_буд_мн_3е$/                     ){  gs_nebu_m3        [$1]=$3; continue };
       };
       if ($2~ /^гл_сов_непер_воз_буд_/ ) {
        if ($2~ /^гл_сов_непер_воз_буд_ед_1е$/                 ){  gs_vz_nebu_e1     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_ед_2е$/                 ){  gs_vz_nebu_e2     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_ед_3е$/                 ){  gs_vz_nebu_e3     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_1е$/                 ){  gs_vz_nebu_m1     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_2е$/                 ){  gs_vz_nebu_m2     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_буд_мн_3е$/                 ){  gs_vz_nebu_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_воз_инф$/                       ){  gs_vz_nein        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_пов_ед$/                    ){  gs_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_пов_мн$/                    ){  gs_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_сов_непер_воз_прош_/ ) {
        if ($2~ /^гл_сов_непер_воз_прош_ед_жен$/               ){  gs_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_ед_муж$/               ){  gs_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_ед_ср$/                ){  gs_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_воз_прош_мн$/                   ){  gs_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_инф$/                           ){  gs_nein           [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_пов_ед$/                        ){  gs_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_пов_мн$/                        ){  gs_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_непер_прош_/ ) {
        if ($2~ /^гл_сов_непер_прош_ед_жен$/                   ){  gs_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_ед_муж$/                   ){  gs_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_ед_ср$/                    ){  gs_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_прош_мн$/                       ){  gs_nepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_непер_воз_инф_безл$/                  ){  gs_vz_nein_bz     [$1]=$3; continue };
        if ($2~ /^гл_сов_непер_инф_безл$/                      ){  gs_nein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_сов_перех_/ ){
       if ($2~ /^гл_сов_перех_буд_/ ) {
        if ($2~ /^гл_сов_перех_буд_ед_1е$/                     ){  gs_pebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_ед_2е$/                     ){  gs_pebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_ед_3е$/                     ){  gs_pebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_1е$/                     ){  gs_pebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_2е$/                     ){  gs_pebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_буд_мн_3е$/                     ){  gs_pebu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перех_инф$/                           ){  gs_pein           [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_пов_ед$/                        ){  gs_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_пов_мн$/                        ){  gs_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_перех_прош_/ ) {
        if ($2~ /^гл_сов_перех_прош_ед_жен$/                   ){  gs_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_ед_муж$/                   ){  gs_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_ед_ср$/                    ){  gs_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_перех_прош_мн$/                       ){  gs_pepa_mn        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перех_инф_безл$/                      ){  gs_pein_bz        [$1]=$3; continue };
      };
      if($2~  /^гл_сов_перне_/ ){
       if ($2~ /^гл_сов_перне_буд_/ ) {
        if ($2~ /^гл_сов_перне_буд_ед_1е$/                     ){  gs_pnbu_e1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_ед_2е$/                     ){  gs_pnbu_e2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_ед_3е$/                     ){  gs_pnbu_e3        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_1е$/                     ){  gs_pnbu_m1        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_2е$/                     ){  gs_pnbu_m2        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_буд_мн_3е$/                     ){  gs_pnbu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_сов_перне_инф$/                           ){  gs_pnin           [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_пов_ед$/                        ){  gs_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_пов_мн$/                        ){  gs_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_сов_перне_прош_/ ) {
        if ($2~ /^гл_сов_перне_прош_ед_жен$/                   ){  gs_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_ед_муж$/                   ){  gs_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_ед_ср$/                    ){  gs_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_сов_перне_прош_мн$/                       ){  gs_pnpa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_перех_/ ){
       if ($2~ /^гл_2вид_перех_буд_/ ) {
        if ($2~ /^гл_2вид_перех_буд_ед_1е$/                    ){  g2_pebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_ед_2е$/                    ){  g2_pebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_ед_3е$/                    ){  g2_pebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_1е$/                    ){  g2_pebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_2е$/                    ){  g2_pebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_буд_мн_3е$/                    ){  g2_pebu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перех_инф$/                          ){  g2_pein           [$1]=$3; continue };

       if ($2~ /^гл_2вид_перех_наст_/ ) {
        if ($2~ /^гл_2вид_перех_наст_ед_1е$/                   ){  g2_pena_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_ед_2е$/                   ){  g2_pena_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_ед_3е$/                   ){  g2_pena_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_1е$/                   ){  g2_pena_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_2е$/                   ){  g2_pena_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_наст_мн_3е$/                   ){  g2_pena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перех_пов_ед$/                       ){  g2_pepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_пов_мн$/                       ){  g2_pepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_перех_прош_/ ) {
        if ($2~ /^гл_2вид_перех_прош_ед_жен$/                  ){  g2_pepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_ед_муж$/                  ){  g2_pepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_ед_ср$/                   ){  g2_pepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перех_прош_мн$/                      ){  g2_pepa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_непер_/ ){
       if ($2~ /^гл_2вид_непер_буд_/ ) {
        if ($2~ /^гл_2вид_непер_буд_ед_1е$/                    ){  g2_nebu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_ед_2е$/                    ){  g2_nebu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_ед_3е$/                    ){  g2_nebu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_1е$/                    ){  g2_nebu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_2е$/                    ){  g2_nebu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_буд_мн_3е$/                    ){  g2_nebu_m3        [$1]=$3; continue };
       };
       if ($2~ /^гл_2вид_непер_воз_буд_/ ) {
        if ($2~ /^гл_2вид_непер_воз_буд_ед_1е$/                ){  g2_vz_nebu_e1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_ед_2е$/                ){  g2_vz_nebu_e2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_ед_3е$/                ){  g2_vz_nebu_e3     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_1е$/                ){  g2_vz_nebu_m1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_2е$/                ){  g2_vz_nebu_m2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_буд_мн_3е$/                ){  g2_vz_nebu_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_воз_инф$/                      ){  g2_vz_nein        [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_воз_наст_/ ) {
        if ($2~ /^гл_2вид_непер_воз_наст_ед_1е$/               ){  g2_vz_nena_e1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_ед_2е$/               ){  g2_vz_nena_e2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_ед_3е$/               ){  g2_vz_nena_e3     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_1е$/               ){  g2_vz_nena_m1     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_2е$/               ){  g2_vz_nena_m2     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_наст_мн_3е$/               ){  g2_vz_nena_m3     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_воз_пов_ед$/                   ){  g2_vz_nepo_ed     [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_пов_мн$/                   ){  g2_vz_nepo_mn     [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_воз_прош_/ ) {
        if ($2~ /^гл_2вид_непер_воз_прош_ед_жен$/              ){  g2_vz_nepa_edze   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_ед_муж$/              ){  g2_vz_nepa_edmu   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_ед_ср$/               ){  g2_vz_nepa_edsr   [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_воз_прош_мн$/                  ){  g2_vz_nepa_mn     [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_инф$/                          ){  g2_nein           [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_наст_/ ) {
        if ($2~ /^гл_2вид_непер_наст_ед_1е$/                   ){  g2_nena_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_ед_2е$/                   ){  g2_nena_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_ед_3е$/                   ){  g2_nena_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_1е$/                   ){  g2_nena_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_2е$/                   ){  g2_nena_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_наст_мн_3е$/                   ){  g2_nena_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_непер_пов_ед$/                       ){  g2_nepo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_пов_мн$/                       ){  g2_nepo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_непер_прош_/ ) {
        if ($2~ /^гл_2вид_непер_прош_ед_жен$/                  ){  g2_nepa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_ед_муж$/                  ){  g2_nepa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_ед_ср$/                   ){  g2_nepa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_непер_прош_мн$/                      ){  g2_nepa_mn        [$1]=$3; continue };
       };
      };
      if($2~  /^гл_2вид_перне_/ ){
       if ($2~ /^гл_2вид_перне_буд_/ ) {
        if ($2~ /^гл_2вид_перне_буд_ед_1е$/                    ){  g2_pnbu_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_ед_2е$/                    ){  g2_pnbu_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_ед_3е$/                    ){  g2_pnbu_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_1е$/                    ){  g2_pnbu_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_2е$/                    ){  g2_pnbu_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_буд_мн_3е$/                    ){  g2_pnbu_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перне_инф$/                          ){  g2_pnin           [$1]=$3; continue };

       if ($2~ /^гл_2вид_перне_наст_/ ) {
        if ($2~ /^гл_2вид_перне_наст_ед_1е$/                   ){  g2_pnna_e1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_ед_2е$/                   ){  g2_pnna_e2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_ед_3е$/                   ){  g2_pnna_e3        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_1е$/                   ){  g2_pnna_m1        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_2е$/                   ){  g2_pnna_m2        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_наст_мн_3е$/                   ){  g2_pnna_m3        [$1]=$3; continue };
       };

        if ($2~ /^гл_2вид_перне_пов_ед$/                       ){  g2_pnpo_ed        [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_пов_мн$/                       ){  g2_pnpo_mn        [$1]=$3; continue };

       if ($2~ /^гл_2вид_перне_прош_/ ) {
        if ($2~ /^гл_2вид_перне_прош_ед_жен$/                  ){  g2_pnpa_edze      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_ед_муж$/                  ){  g2_pnpa_edmu      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_ед_ср$/                   ){  g2_pnpa_edsr      [$1]=$3; continue };
        if ($2~ /^гл_2вид_перне_прош_мн$/                      ){  g2_pnpa_mn        [$1]=$3; continue };
       };
      };
       if ($2~  /^дееп_/ ){
        if ($2~ /^дееп_сов_перех_прош$/                        ){  dps_pe_pa         [$1]=$3; continue };
        if ($2~ /^дееп_сов_непер_воз_прош$/                    ){  dps_vz_ne_pa      [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_воз_наст$/                  ){  dpn_vz_ne_na      [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_воз_прош$/                  ){  dpn_vz_ne_pa      [$1]=$3; continue };
        if ($2~ /^дееп_несов_перех_наст$/                      ){  dpn_pe_na         [$1]=$3; continue };
        if ($2~ /^дееп_сов_непер_прош$/                        ){  dps_ne_pa         [$1]=$3; continue };
        if ($2~ /^дееп_сов_перне_прош$/                        ){  dps_pn_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_наст$/                      ){  dpn_ne_na         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перне_наст$/                      ){  dpn_pn_na         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перех_прош$/                      ){  dpn_pe_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_перне_прош$/                      ){  dpn_pn_pa         [$1]=$3; continue };
        if ($2~ /^дееп_несов_непер_прош$/                      ){  dpn_ne_pa         [$1]=$3; continue };
       };
    }; # чтение gl-dic

   close(cmd);
   cmd = "zcat " locdic "dic_rest.gz";
   while ((cmd|getline) > 0) {

    if ($1~  "-"  ) { dichyph[$1] };
    if ($4== "NOP") { continue };
#    BF[$1] = "#" $3;

    if($2~  /^нар/ ){
        if ($2~ /^нар_сравн$/                                  ){  nr_srv            [$1]=$3; continue };
        if ($2~ /^нар_опред_кач$/                              ){  nr_opka           [$1]=$3; continue };
        if ($2~ /^нар_опред_спос$/                             ){  nr_opsp           [$1]=$3; continue };
        if ($2~ /^нар_опред_степ$/                             ){  nr_opst           [$1]=$3; continue };
        if ($2~ /^нар_обст_врем$/                              ){  nr_obvr           [$1]=$3; continue };
        if ($2~ /^нар_обст_места$/                             ){  nr_obme           [$1]=$3; continue };
        if ($2~ /^нар_обст_напр$/                              ){  nr_obna           [$1]=$3; continue };
        if ($2~ /^нар_обст_причин$/                            ){  nr_obpr           [$1]=$3; continue };
        if ($2~ /^нар_обст_цель$/                              ){  nr_obce           [$1]=$3; continue };
        if ($2~ /^нар_вопр$/                                   ){  nr_vopr           [$1]=$3; continue };
        if ($2~ /^нар_мест$/                                   ){  nr_mest           [$1]=$3; continue };
        if ($2~ /^нар_прев$/                                   ){  nr_pv             [$1]=$3; continue };
        if ($2~ /^нар$/                                        ){  nr_nar            [$1]=$3; continue };
    };

        if ($2~ /^предик$/                                     ){  predk             [$1]=$3; continue };
        if ($2~ /^межд$/                                       ){  mzd               [$1]=$3; continue };
        if ($2~ /^част$/                                       ){  qst               [$1]=$3; continue };
        if ($2~ /^ввод$/                                       ){  vvodn             [$1]=$3; continue };
        if ($2~ /^союз$/                                       ){  soyz              [$1]=$3; continue };

    if($2~  /^мест_/ ){
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин$/                  ){  mst_ed_mu_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин_неод$/             ){  mst_ed_mu_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_вин_одуш$/             ){  mst_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_дат$/                  ){  mst_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_им$/                   ){  mst_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_пр$/                   ){  mst_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_род$/                  ){  mst_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_муж_тв$/                   ){  mst_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_вин$/                  ){  mst_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_дат$/                  ){  mst_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_им$/                   ){  mst_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_пр$/                   ){  mst_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_род$/                  ){  mst_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен_тв$/                   ){  mst_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_вин$/                   ){  mst_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_дат$/                   ){  mst_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_им$/                    ){  mst_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_пр$/                    ){  mst_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_род$/                   ){  mst_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_ср_тв$/                    ){  mst_ed_sr_tv      [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_мн_вин_неод$/                 ){  mst_mn_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_вин_одуш$/                 ){  mst_mn_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_вин$/                      ){  mst_mn_vi         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_дат$/                      ){  mst_mn_da         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_им$/                       ){  mst_mn_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_пр$/                       ){  mst_mn_pr         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_род$/                      ){  mst_mn_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_мн_тв$/                       ){  mst_mn_tv         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_ед_вин$/                      ){  mst_ed_vi         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_им$/                       ){  mst_ed_im         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_дат$/                      ){  mst_ed_da         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_пр$/                       ){  mst_ed_pr         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_род$/                      ){  mst_ed_ro         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_тв$/                       ){  mst_ed_tv         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_ед_муж$/                      ){  mst_ed_mu         [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_ед_жен$/                      ){  mst_ed_ze         [$1]=$3; continue };
        if ($2~ /^мест_прл_ед_ср$/                             ){  mst_ed_sr         [$1]=$3; continue };

        if ($2~ /^мест_(сущ|прл)_им$/                          ){  mst_im            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_вин$/                         ){  mst_vi            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_дат$/                         ){  mst_da            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_пр$/                          ){  mst_pr            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_род$/                         ){  mst_ro            [$1]=$3; continue };
        if ($2~ /^мест_(сущ|прл)_тв$/                          ){  mst_tv            [$1]=$3; continue };
    };
    if($2~  /^предл_/ ){
        if ($2~ /^предл_вин$/                                  ){  pred_vi           [$1]=$3; continue };
        if ($2~ /^предл_дат$/                                  ){  pred_da           [$1]=$3; continue };
        if ($2~ /^предл_им$/                                   ){  pred_im           [$1]=$3; continue };
        if ($2~ /^предл_пр$/                                   ){  pred_pr           [$1]=$3; continue };
        if ($2~ /^предл_род$/                                  ){  pred_ro           [$1]=$3; continue };
        if ($2~ /^предл_тв$/                                   ){  pred_tv           [$1]=$3; continue };
    };
    if ($2~ /^числ_/ ) {                                           qall              [$1]=$3;
      if ($2~ /^числ_кол_/ ) {
        if ($2~ /^числ_кол_вин$/                               ){  qko_vi            [$1]=$3; continue };
        if ($2~ /^числ_кол_дат$/                               ){  qko_da            [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_вин$/                        ){  qko_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_дат$/                        ){  qko_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_им$/                         ){  qko_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_пр$/                         ){  qko_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_род$/                        ){  qko_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_жен_тв$/                         ){  qko_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_вин$/                        ){  qko_ed_mu_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_дат$/                        ){  qko_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_им$/                         ){  qko_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_пр$/                         ){  qko_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_род$/                        ){  qko_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_муж_тв$/                         ){  qko_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_вин$/                         ){  qko_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_дат$/                         ){  qko_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_им$/                          ){  qko_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_пр$/                          ){  qko_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_род$/                         ){  qko_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^числ_кол_ед_ср_тв$/                          ){  qko_ed_sr_tv      [$1]=$3; continue };
        if ($2~ /^числ_кол_жен_вин$/                           ){  qko_ze_vi         [$1]=$3; continue };
        if ($2~ /^числ_кол_жен_им$/                            ){  qko_ze_im         [$1]=$3; continue };
        if ($2~ /^числ_кол_им$/                                ){  qko_im            [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_вин$/                            ){  qko_mn_vi         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_дат$/                            ){  qko_mn_da         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_им$/                             ){  qko_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_пр$/                             ){  qko_mn_pr         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_род$/                            ){  qko_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_кол_мн_тв$/                             ){  qko_mn_tv         [$1]=$3; continue };
        if ($2~ /^числ_кол_пр$/                                ){  qko_pr            [$1]=$3; continue };
        if ($2~ /^числ_кол_род$/                               ){  qko_ro            [$1]=$3; continue };
        if ($2~ /^числ_кол_тв$/                                ){  qko_tv            [$1]=$3; continue };
      };
      if ($2~ /^числ_неопр_/ ) {

        if ($2~ /^числ_неопр_вин$/                             ){  qne_vi            [$1]=$3; continue };
        if ($2~ /^числ_неопр_дат$/                             ){  qne_da            [$1]=$3; continue };
        if ($2~ /^числ_неопр_им$/                              ){  qne_im            [$1]=$3; continue };
        if ($2~ /^числ_неопр_пр$/                              ){  qne_pr            [$1]=$3; continue };
        if ($2~ /^числ_неопр_род$/                             ){  qne_ro            [$1]=$3; continue };
        if ($2~ /^числ_неопр_тв$/                              ){  qne_tv            [$1]=$3; continue };
      };
      if ($2~ /^числ_поряд_/ ) {

        if ($2~ /^числ_поряд_ед_жен_вин$/                      ){  qpo_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_дат$/                      ){  qpo_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_им$/                       ){  qpo_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_пр$/                       ){  qpo_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_род$/                      ){  qpo_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_жен_тв$/                       ){  qpo_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_вин_неод$/                 ){  qpo_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_вин_одуш$/                 ){  qpo_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_дат$/                      ){  qpo_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_им$/                       ){  qpo_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_пр$/                       ){  qpo_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_род$/                      ){  qpo_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_муж_тв$/                       ){  qpo_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_вин$/                       ){  qpo_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_дат$/                       ){  qpo_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_им$/                        ){  qpo_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_пр$/                        ){  qpo_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_род$/                       ){  qpo_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^числ_поряд_ед_ср_тв$/                        ){  qpo_ed_sr_tv      [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_вин_неод$/                     ){  qpo_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_вин_одуш$/                     ){  qpo_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_дат$/                          ){  qpo_mn_da         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_им$/                           ){  qpo_mn_im         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_пр$/                           ){  qpo_mn_pr         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_род$/                          ){  qpo_mn_ro         [$1]=$3; continue };
        if ($2~ /^числ_поряд_мн_тв$/                           ){  qpo_mn_tv         [$1]=$3; continue };
      };
      if ($2~ /^числ_собир_/ ) {

        if ($2~ /^числ_собир_вин$/                             ){  qso_vi            [$1]=$3; continue };
        if ($2~ /^числ_собир_дат$/                             ){  qso_da            [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_вин$/                         ){  qso_ze_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_дат$/                         ){  qso_ze_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_им$/                          ){  qso_ze_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_пр$/                          ){  qso_ze_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_род$/                         ){  qso_ze_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_жен_тв$/                          ){  qso_ze_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_им$/                              ){  qso_im            [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_вин$/                         ){  qso_mu_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_дат$/                         ){  qso_mu_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_им$/                          ){  qso_mu_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_пр$/                          ){  qso_mu_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_род$/                         ){  qso_mu_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_муж_тв$/                          ){  qso_mu_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_пр$/                              ){  qso_pr            [$1]=$3; continue };
        if ($2~ /^числ_собир_род$/                             ){  qso_ro            [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_вин$/                          ){  qso_sr_vi         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_дат$/                          ){  qso_sr_da         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_им$/                           ){  qso_sr_im         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_пр$/                           ){  qso_sr_pr         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_род$/                          ){  qso_sr_ro         [$1]=$3; continue };
        if ($2~ /^числ_собир_ср_тв$/                           ){  qso_sr_tv         [$1]=$3; continue };
        if ($2~ /^числ_собир_тв$/                              ){  qso_tv            [$1]=$3; continue };
      };
    };
   }; # чтение rest-dic
   close(cmd);
   cmd = "zcat " indb "dic_cust.gz";
   while ((cmd|getline) > 0) {

   if ($1~  "-"  ) { dichyph[$1] };
   if ($4== "NOP") { continue };

   if ($2~ /^muk_/) {
        if($2~  /_ед_муж_им$/                                  ){  muc_edmuim        [$1]=$3; continue };
        if($2~  /_ед_жен_им$/                                  ){  muc_edzeim        [$1]=$3; continue };
        if($2~  /_ед_ср_им$/                                   ){  muc_edsrim        [$1]=$3; continue };
        if($2~  /_ед_муж_вин/                                  ){  muc_edmuvi        [$1]=$3; continue };
        if($2~  /_ед_жен_вин/                                  ){  muc_edzevi        [$1]=$3; continue };
        if($2~  /_ед_ср_вин/                                   ){  muc_edsrvi        [$1]=$3; continue };
        if($2~  /_ед_муж_дат$/                                 ){  muc_edmuda        [$1]=$3; continue };
        if($2~  /_ед_жен_дат$/                                 ){  muc_edzeda        [$1]=$3; continue };
        if($2~  /_ед_ср_дат$/                                  ){  muc_edsrda        [$1]=$3; continue };
        if($2~  /_ед_муж_род$/                                 ){  muc_edmuro        [$1]=$3; continue };
        if($2~  /_ед_жен_род$/                                 ){  muc_edzero        [$1]=$3; continue };
        if($2~  /_ед_ср_род$/                                  ){  muc_edsrro        [$1]=$3; continue };
        if($2~  /_ед_муж_тв$/                                  ){  muc_edmutv        [$1]=$3; continue };
        if($2~  /_ед_жен_тв$/                                  ){  muc_edzetv        [$1]=$3; continue };
        if($2~  /_ед_ср_тв$/                                   ){  muc_edsrtv        [$1]=$3; continue };
        if($2~  /_ед_муж_пр$/                                  ){  muc_edmupr        [$1]=$3; continue };
        if($2~  /_ед_жен_пр$/                                  ){  muc_edzepr        [$1]=$3; continue };
        if($2~  /_ед_ср_пр$/                                   ){  muc_edsrpr        [$1]=$3; continue };
        if($2~  /_мн_им$/                                      ){  muc_mnim          [$1]=$3; continue };
        if($2~  /_мн_вин/                                      ){  muc_mnvi          [$1]=$3; continue };
        if($2~  /_мн_дат$/                                     ){  muc_mnda          [$1]=$3; continue };
        if($2~  /_мн_род$/                                     ){  muc_mnro          [$1]=$3; continue };
        if($2~  /_мн_тв$/                                      ){  muc_mntv          [$1]=$3; continue };
        if($2~  /_мн_пр$/                                      ){  muc_mnpr          [$1]=$3; continue };
        if($2~  /^muk_прл_им$/                                 ){  muc_mnim          [$1]=$3; continue };
        if($2~  /^muk_прл_вин$/                                ){  muc_mnvi          [$1]=$3; continue };
        if($2~  /^muk_прл_дат$/                                ){  muc_mnda          [$1]=$3; continue };
        if($2~  /^muk_прл_род$/                                ){  muc_mnro          [$1]=$3; continue };
        if($2~  /^muk_прл_тв$/                                 ){  muc_mntv          [$1]=$3; continue };
        if($2~  /^muk_прл_пр$/                                 ){  muc_mnpr          [$1]=$3; continue };
   };
   if ($2~ /^otnmest_/) {
        if($2~  /_ед_муж_им$/                                  ){  otm_edmuim        [$1]=$3; continue };
        if($2~  /_ед_жен_им$/                                  ){  otm_edzeim        [$1]=$3; continue };
        if($2~  /_ед_ср_им$/                                   ){  otm_edsrim        [$1]=$3; continue };
        if($2~  /_ед_муж_вин/                                  ){  otm_edmuvi        [$1]=$3; continue };
        if($2~  /_ед_жен_вин/                                  ){  otm_edzevi        [$1]=$3; continue };
        if($2~  /_ед_ср_вин/                                   ){  otm_edsrvi        [$1]=$3; continue };
        if($2~  /_ед_муж_дат$/                                 ){  otm_edmuda        [$1]=$3; continue };
        if($2~  /_ед_жен_дат$/                                 ){  otm_edzeda        [$1]=$3; continue };
        if($2~  /_ед_ср_дат$/                                  ){  otm_edsrda        [$1]=$3; continue };
        if($2~  /_ед_муж_род$/                                 ){  otm_edmuro        [$1]=$3; continue };
        if($2~  /_ед_жен_род$/                                 ){  otm_edzero        [$1]=$3; continue };
        if($2~  /_ед_ср_род$/                                  ){  otm_edsrro        [$1]=$3; continue };
        if($2~  /_ед_муж_тв$/                                  ){  otm_edmutv        [$1]=$3; continue };
        if($2~  /_ед_жен_тв$/                                  ){  otm_edzetv        [$1]=$3; continue };
        if($2~  /_ед_ср_тв$/                                   ){  otm_edsrtv        [$1]=$3; continue };
        if($2~  /_ед_муж_пр$/                                  ){  otm_edmupr        [$1]=$3; continue };
        if($2~  /_ед_жен_пр$/                                  ){  otm_edzepr        [$1]=$3; continue };
        if($2~  /_ед_ср_пр$/                                   ){  otm_edsrpr        [$1]=$3; continue };
        if($2~  /_мн_им$/                                      ){  otm_mnim          [$1]=$3; continue };
        if($2~  /_мн_вин/                                      ){  otm_mnvi          [$1]=$3; continue };
        if($2~  /_мн_дат$/                                     ){  otm_mnda          [$1]=$3; continue };
        if($2~  /_мн_род$/                                     ){  otm_mnro          [$1]=$3; continue };
        if($2~  /_мн_тв$/                                      ){  otm_mntv          [$1]=$3; continue };
        if($2~  /_мн_пр$/                                      ){  otm_mnpr          [$1]=$3; continue };
    };
    if($2~  /^mop_/ ){
        if ($2~ /^mop_мест_(сущ|прл)_ед_муж_вин$/              ){  msto_ed_mu_vi      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_муж_вин_неод$/         ){  msto_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_муж_вин_одуш$/         ){  msto_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_муж_дат$/              ){  msto_ed_mu_da      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_муж_им$/               ){  msto_ed_mu_im      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_муж_пр$/               ){  msto_ed_mu_pr      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_муж_род$/              ){  msto_ed_mu_ro      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_муж_тв$/               ){  msto_ed_mu_tv      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_жен_вин$/              ){  msto_ed_ze_vi      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_жен_дат$/              ){  msto_ed_ze_da      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_жен_им$/               ){  msto_ed_ze_im      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_жен_пр$/               ){  msto_ed_ze_pr      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_жен_род$/              ){  msto_ed_ze_ro      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_жен_тв$/               ){  msto_ed_ze_tv      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_ср_вин$/               ){  msto_ed_sr_vi      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_ср_дат$/               ){  msto_ed_sr_da      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_ср_им$/                ){  msto_ed_sr_im      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_ср_пр$/                ){  msto_ed_sr_pr      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_ср_род$/               ){  msto_ed_sr_ro      [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_ср_тв$/                ){  msto_ed_sr_tv      [$1]=$3; continue };

        if ($2~ /^mop_мест_(сущ|прл)_мн_вин_неод$/             ){  msto_mn_im         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_мн_вин_одуш$/             ){  msto_mn_ro         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_мн_вин$/                  ){  msto_mn_vi         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_мн_дат$/                  ){  msto_mn_da         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_мн_им$/                   ){  msto_mn_im         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_мн_пр$/                   ){  msto_mn_pr         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_мн_род$/                  ){  msto_mn_ro         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_мн_тв$/                   ){  msto_mn_tv         [$1]=$3; continue };

        if ($2~ /^mop_мест_(сущ|прл)_ед_вин$/                  ){  msto_ed_vi         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_им$/                   ){  msto_ed_im         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_дат$/                  ){  msto_ed_da         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_пр$/                   ){  msto_ed_pr         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_род$/                  ){  msto_ed_ro         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_тв$/                   ){  msto_ed_tv         [$1]=$3; continue };

        if ($2~ /^mop_мест_(сущ|прл)_ед_муж$/                  ){  msto_ed_mu         [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_ед_жен$/                  ){  msto_ed_ze         [$1]=$3; continue };
        if ($2~ /^mop_мест_прл_ед_ср$/                         ){  msto_ed_sr         [$1]=$3; continue };

        if ($2~ /^mop_мест_(сущ|прл)_им$/                      ){  msto_im            [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_вин$/                     ){  msto_vi            [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_дат$/                     ){  msto_da            [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_пр$/                      ){  msto_pr            [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_род$/                     ){  msto_ro            [$1]=$3; continue };
        if ($2~ /^mop_мест_(сущ|прл)_тв$/                      ){  msto_tv            [$1]=$3; continue };

     };

        if ($2~ /^прл_аффикс$/                                 ){  pl_affix           [$1]=$3; continue };

    } close(cmd);

 # Список классов омографов с описательными тэгами. Неочевидные кодировки в позиции падежа: z=партитив, l=локатив, q=счетная форма
   cmd = "zcat " indb "class.list.gz";
   while ((cmd|getline) > 0) {
	   for (i=2; i<=NF; i++) { xclass[$1][i-1]=$i };
   } close(cmd);

   cmd = "zcat " indb "automo.gz"
   while ((cmd|getline) > 0) {
         gsub("\\\\xcc\\\\xa0","\xcc\xa0",$4); gsub("\\\\xcc\\\\xa3","\xcc\xa3",$4); gsub("\\\\xcc\\\\xa4","\xcc\xa4",$4)
         gsub("\\\\xcc\\\\xad","\xcc\xad",$4); gsub("\\\\xcc\\\\xb0","\xcc\xb0",$4); gsub("\x27","\xcc\x81",$4)

         word=$2; Word=toupper(substr($2,1,1)) substr($2,2); WORD=toupper($2); # Формы "стандартных" омографов
         omo =$4; Omo =toupper(substr($4,1,1)) substr($4,2); OMO =toupper($4); # Формы "стандартных" омогформ

         almo[word]=almo[Word]=almo[WORD]=$1; oms[$1]["info"][word]=$9;
         oms[$1][$3][word]=omo; oms[$1][$3][Word]=Omo; oms[$1][$3][WORD]=OMO;
   }; close(cmd);

   cmd = "zcat " indb "omoid_auto.gz";
   while ((cmd|getline) > 0) {
           if ($1 ~ /^[а-яё]+$/) { omoid[$1][$3][$2]; continue }
           else {
              if ($1== "ispa_abst"   ) {for ( j in ispa_abst   ) { omoid[j][$3][$2] }; continue };
              if ($1== "ispa_gas"    ) {for ( j in ispa_gas    ) { omoid[j][$3][$2] }; continue };
              if ($1== "ispa_food"   ) {for ( j in ispa_food   ) { omoid[j][$3][$2] }; continue };
              if ($1== "ispa_liquid" ) {for ( j in ispa_liquid ) { omoid[j][$3][$2] }; continue };
              if ($1== "ispa_loose"  ) {for ( j in ispa_loose  ) { omoid[j][$3][$2] }; continue };
              if ($1== "ispa_solid"  ) {for ( j in ispa_solid  ) { omoid[j][$3][$2] }; continue };
              if ($1== "ispa_any"    ) {for ( j in ispa_any    ) { omoid[j][$3][$2] }; continue };
           }
   }; close(cmd); # словарик связаных слов, омоид в поле 1, омограф(ы) с 3-го поля

   cmd = "zcat " indb "omoid_flat.gz";
   while ((cmd|getline) > 0) {
       for (i=3; i<=NF; i++) {
           if ($i ~ /^[а-яё]+$/) { omoid[$1][$i][$2]; continue }
           else {
              if ($i== "ispa_abst"   ) {for ( j in ispa_abst   ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_gas"    ) {for ( j in ispa_gas    ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_food"   ) {for ( j in ispa_food   ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_liquid" ) {for ( j in ispa_liquid ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_loose"  ) {for ( j in ispa_loose  ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_solid"  ) {for ( j in ispa_solid  ) { omoid[$1][j][$2] }; continue };
              if ($i== "ispa_any"    ) {for ( j in ispa_any    ) { omoid[$1][j][$2] }; continue };
           }; }
   }; close(cmd); # словарик связаных слов, омоид в поле 3+, омограф в 1 поле

   # обработанные слова в их конечной форме
   cmd = "zcat " indb "ist.gz | \
          sed -r 's/([аеёиоуыэюя])\\x27/\\1\\xcc\\x81/g; \
                  s/\\\\xcc\\\\xa0/\\xcc\\xa0/g; \
                  s/\\\\xcc\\\\xa3/\\xcc\\xa3/g; \
                  s/\\\\xcc\\\\xa4/\\xcc\\xa4/g; \
                  s/\\\\xcc\\\\xad/\\xcc\\xad/g; \
                  s/\\\\xcc\\\\xb0/\\xcc\\xb0/g'";
   while ((cmd|getline) > 0) {
         if($2== "is_nar_mest"         ){ is_nar_mest         [$1]; continue };
         if($2== "is_nar_napr"         ){ is_nar_napr         [$1]; continue };
         if($2== "is_nar_spos"         ){ is_nar_spos         [$1]; continue };
         if($2== "is_nar_vrem"         ){ is_nar_vrem         [$1]; continue };
         if($2== "is_prl_edmuim"       ){ is_prl_edmuim       [$1]; continue };
         if($2== "is_prl_edmupr"       ){ is_prl_edmupr       [$1]; continue };
         if($2== "is_prl_edmuvi"       ){ is_prl_edmuvi       [$1]; continue };
         if($2== "is_prl_edsrpr"       ){ is_prl_edsrpr       [$1]; continue };
         if($2== "is_prl_edzeda"       ){ is_prl_edzeda       [$1]; continue };
         if($2== "is_prl_edzeim"       ){ is_prl_edzeim       [$1]; continue };
         if($2== "is_prl_edzepr"       ){ is_prl_edzepr       [$1]; continue };
         if($2== "is_prl_edzero"       ){ is_prl_edzero       [$1]; continue };
         if($2== "is_prl_edzetv"       ){ is_prl_edzetv       [$1]; continue };
         if($2== "is_prl_kred_mu"      ){ is_prl_kred_mu      [$1]; continue };
         if($2== "is_prl_kred_ze"      ){ is_prl_kred_ze      [$1]; continue };
         if($2== "is_prl_krmn"         ){ is_prl_krmn         [$1]; continue };
         if($2== "is_suw_edmuda"       ){ is_suw_edmuda       [$1]; continue };
         if($2== "is_suw_edmuim"       ){ is_suw_edmuim       [$1]; continue };
         if($2== "is_suw_edmulo"       ){ is_suw_edmulo       [$1]; continue };
         if($2== "is_suw_edmune"       ){ is_suw_edmune       [$1]; continue };
         if($2== "is_suw_edmupa"       ){ is_suw_edmupa       [$1]; continue };
         if($2== "is_suw_edmupr"       ){ is_suw_edmupr       [$1]; continue };
         if($2== "is_suw_edmuro"       ){ is_suw_edmuro       [$1]; continue };
         if($2== "is_suw_edmusq"       ){ is_suw_edmusq       [$1]; continue };
         if($2== "is_suw_edmutv"       ){ is_suw_edmutv       [$1]; continue };
         if($2== "is_suw_edmuvi"       ){ is_suw_edmuvi       [$1]; continue };
         if($2== "is_suw_edmuzv"       ){ is_suw_edmuzv       [$1]; continue };
         if($2== "is_suw_edsrda"       ){ is_suw_edsrda       [$1]; continue };
         if($2== "is_suw_edsrim"       ){ is_suw_edsrim       [$1]; continue };
         if($2== "is_suw_edsrne"       ){ is_suw_edsrne       [$1]; continue };
         if($2== "is_suw_edsrpr"       ){ is_suw_edsrpr       [$1]; continue };
         if($2== "is_suw_edsrro"       ){ is_suw_edsrro       [$1]; continue };
         if($2== "is_suw_edsrtv"       ){ is_suw_edsrtv       [$1]; continue };
         if($2== "is_suw_edsrvi"       ){ is_suw_edsrvi       [$1]; continue };
         if($2== "is_suw_edsrzv"       ){ is_suw_edsrzv       [$1]; continue };
         if($2== "is_suw_edzeda"       ){ is_suw_edzeda       [$1]; continue };
         if($2== "is_suw_edzeim"       ){ is_suw_edzeim       [$1]; continue };
         if($2== "is_suw_edzelo"       ){ is_suw_edzelo       [$1]; continue };
         if($2== "is_suw_edzepr"       ){ is_suw_edzepr       [$1]; continue };
         if($2== "is_suw_edzero"       ){ is_suw_edzero       [$1]; continue };
         if($2== "is_suw_edzetv"       ){ is_suw_edzetv       [$1]; continue };
         if($2== "is_suw_edzevi"       ){ is_suw_edzevi       [$1]; continue };
         if($2== "is_suw_mnda"         ){ is_suw_mnda         [$1]; continue };
         if($2== "is_suw_mnim"         ){ is_suw_mnim         [$1]; continue };
         if($2== "is_suw_mnpr"         ){ is_suw_mnpr         [$1]; continue };
         if($2== "is_suw_mnro"         ){ is_suw_mnro         [$1]; continue };
         if($2== "is_suw_mnvi"         ){ is_suw_mnvi         [$1]; continue };
     }; # связаных слов
   close(cmd);


   dbg=dbgstat=""

 # Записать состояние словарных массивов
  if (gawk52 == 1) { writeall(classcache) };

  if (locdic ~ "^scriptdb\x2f$") {
     cmd = "md5sum " indb "classes.awk " \
                     inax "classes.bin " \
                     indb "dic_cust.gz " \
                     indb "dic_gl.gz " \
                     indb "dic_prl.gz " \
                     indb "dic_prq.gz " \
                     indb "dic_rest.gz " \
                     indb "dic_suw.gz " \
                     indb "automo.gz " \
                     indb "class.list.gz " \
                     indb "omoid_auto.gz " \
                     indb "omoid_flat.gz " \
                     indb "ist.gz "\
                     indb "cstauto.awk " "> " inax "classes.md5"
  } else {
     cmd = "md5sum " indb "classes.awk " \
                     locdic "classes.bin " \
                     locdic "locdic.md5 " \
                     indb "dic_cust.gz " \
                     locdic "dic_gl.gz " \
                     locdic "dic_prl.gz " \
                     locdic "dic_prq.gz " \
                     locdic "dic_rest.gz " \
                     locdic "dic_suw.gz " \
                     indb "automo.gz " \
                     indb "class.list.gz " \
                     indb "omoid_auto.gz " \
                     indb "omoid_flat.gz " \
                     indb "ist.gz " \
                     indb "cstauto.awk " "> " locdic "classes.md5"
  }
  system(cmd); close(cmd)
   }; # readall bases
  } else { # noredix -- читаем только классы и омографы

       # Список классов омографов с описательными тэгами. Неочевидные кодировки в позиции падежа: z=партитив, l=локатив, q=счетная форма
         cmd = "zcat " indb "class.list.gz";
         while ((cmd|getline) > 0) {
           for (i=2; i<=NF; i++) { xclass[$1][i-1]=$i };
         } close(cmd);

         cmd = "zcat " indb "automo.gz | \
                sed -r 's/([аеёиоуыэюя])\\x27/\\1\\xcc\\x81/g; \
                        s/\\\\xcc\\\\xa0/\\xcc\\xa0/g; \
                        s/\\\\xcc\\\\xa3/\\xcc\\xa3/g; \
                        s/\\\\xcc\\\\xa4/\\xcc\\xa4/g; \
                        s/\\\\xcc\\\\xad/\\xcc\\xad/g; \
                        s/\\\\xcc\\\\xb0/\\xcc\\xb0/g; \
                        s/^(x[0-9]+)\\s([^ ]+)\\s([^ ]+)\\s([^ ]+)(\\s.+)?/\\1 \\3 \\2 \\4 \\u\\2 \\u\\4 \\U\\2\\E \\U\\4\\E \\5/g'";
                                                                          #  1   2   3   4      5      6      7         8      9
         while ((cmd|getline) > 0) {
               almo[$3]=almo[$5]=almo[$7]=$1; oms[$1][$2][$3]=$4; oms[$1][$2][$5]=$6; oms[$1][$2][$7]=$8; oms[$1]["info"][$3]=$9;
         }; close(cmd);

  } # noredix

 # Коррекции - удаление омографов из массивов производятся выставлений 3-го поля в NOP.

# for (k=1; k<=664; k++) { printf ("%s%s %s %s\n", "R", k, "=", DIC[k]); sumdic = sumdic + DIC[k] }; print sumdic;

}

