@load "rwarray"

BEGIN {

   _unxy   = "\xcc\x81\xcc\xa0\xcc\xa3\xcc\xa4\xcc\xad\xcc\xb0"
   _RUUC   = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"
   _rulc   = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
   _LAUC   = "A-ZÀÁÂÃÄÅĀĂÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝ"
   _lalc   = "a-zàáâãäåāăæçèéêëìíîïðñòóôõöøùúûüýß"

   unxy    = "[" _unxy "]"
   unxyp   = "[" _unxy "]+"
   unxn    = "[^" _unxy "]"
   RUUC    = "[" _RUUC "]+"
   RUUC_   = "[" _RUUC "]"
   rulc    = "[" _rulc "]+"
   rulc_   = "[" _rulc "]"
   LAUC_   = "[" _LAUC "]"
   lalc    = "[" _lalc "]+"
   patword = "[" _RUUC _rulc _unxy "0-9]+"
   regword = "[" _RUUC _rulc _unxy "]"
   fsword  = "[^" _RUUC _rulc _unxy "]"
   capword = "^[" _RUUC "]+$"

   vvpat   = "[,—]"
   hysnip  = regword "[-]" regword

    # массивы для разных целей, читаемые из строк (в противоположность "из баз" *.gz)
    # Метки:
    # BASE = список базовых форм (инфинитив, и.п.ед.ч, и т.д.)             = ba bba bfa
    # FLAT = список слов в определённых формах (падел, лицо, время и т.д.) = wa wba wfa

    # расширенное "это"
    cst="оно се сие се се то это";                                                                      stoar(cst,mst_it," ");
    # Предлоги, разделенные по однозначности
    cst="а-ля";                                                                                         stoar(cst,predc_im," ");
    cst="включая исключая минуя погодя покеда про сквозь скрозь спустя считая через черезо чрез чрезо"; stoar(cst,predc_vi," ");
    cst="акромя без безо близ вблизи вверху ввиду вглубь вдали вдоль взамен вкось вкруг вместо вне внизу внутри внутрь вовнутрь возле вокруг волею вперед впереди времен \
         вроде вследствие встречь выше для до заботами заместо заради из из-за из-под из-подо изнутри изо именем имени касаемо касательно кроме кругом мимо наверху \
         навроде назади накануне наподобие наподобье напротив насупротив насчет недалеко независимо ниже обок обочь около окрест окроме окромя опосля опричь от \
         относительно ото памяти поблизости повдоль поверх подле позади позадь позднее поздней позже помимо поперед поперек порядка посереди посередине посередке \
         посередь после посреди посредине посредством превыше прежде против противу путем ради раньше сбоку сверх сверху свыше середи середь сзади силами снаружи снизу \
         спереди среди средь супротив типа у ценой ценою";
                                                                                                        stoar(cst,predc_ro," ");
    cst="благодаря вдогон вдогонку вопреки вослед вразрез вслед к ко навстречу наперекор наперерез наперехват подобно противно согласно сообразно соответственно \
         соразмерно сродни";
                                                                                                        stoar(cst,predc_da," ");
    cst="кончая над надо начиная по-над по-под";                                                        stoar(cst,predc_tv," ");
    cst="при";                                                                                          stoar(cst,predc_pr," ");
    cst="в во";                                                                                         stoar(cst,predc_imvipr," ");
    cst="на о об обо";                                                                                  stoar(cst,predc_vipr," ");
    cst="за пред предо по-за под подо пред предо";                                                      stoar(cst,predc_vitv," ");
    cst="меж между промеж промежду";                                                                    stoar(cst,predc_rotv," ");
    cst="с со";                                                                                         stoar(cst,predc_virotv," ");
    cst="по";                                                                                           stoar(cst,predc_vidapr," ");
    # двойственное число
    cst="два оба половина полтора три четверть четыре";                                                 stoar(cst,qd_duom," ");
    cst="две обе половина полторы три четверть четыре";                                                 stoar(cst,qd_duoz," ");
    # местоимения с точки зрения определения рода существительного
    cst="ваш весь мой наш свой сей такой твой тот эдакий этот коий";                                    stoar(cst,mstc_edmuim," ");
    cst="вашего всего моего нашего своего сего такого твоего того эдакого этого коего";                 stoar(cst,mstc_edmuro," ");
    cst="вашему всему моему нашему своему сему такому твоему тому эдакому этому коему";                 stoar(cst,mstc_edmuda," ");
    cst="вашим всем моим нашим своим сим таким твоим тем эдаким этим коим";                             stoar(cst,mstc_edmutv," ");
    cst="вашем всем всем моем моем нашем своем своем сем сем таком твоем твоем том эдаком этом коем";   stoar(cst,mstc_edmupr," ");

    cst="ваше все все мое мое наше свое свое се се такое твое твое то эдакое это кое";                  stoar(cst,mstc_edsrim," ");
#   cst="вашего всего моего нашего своего сего такого твоего того эдакого этого";                       stoar(cst,mstc_edsrro," ");
#   cst="вашему всему моему нашему своему сему такому твоему тому эдакому этому";                       stoar(cst,mstc_edsrda," ");
#   cst="вашим всем моим нашим своим сим таким твоим тем эдаким этим";                                  stoar(cst,mstc_edsrtv," ");
#   cst="вашем всем всем моем моем нашем своем своем сем сем таком твоем твоем том эдаком этом";
#                                                                                                       stoar(cst,mstc_edsrpr," ");

    cst="ваша вся моя наша своя сия та такая твоя эдакая эта коя";                                      stoar(cst,mstc_edzeim," ");
    cst="вашу всю мою нашу свою сию такую твою ту эдакую эту кою";                                      stoar(cst,mstc_edzevi," ");
    cst="вашей всей моей нашей своей сей такой твоей той эдакой этой коей";                             stoar(cst,mstc_edzero," ");
#   cst="вашей всей моей нашей своей сей такой твоей той эдакой этой";                                  stoar(cst,mstc_edzeda," ");
#   cst="вашей всей моей нашей своей сей такой твоей той эдакой этой";                                  stoar(cst,mstc_edzetv," ");
#   cst="вашей всей моей нашей своей сей такой твоей той эдакой этой";                                  stoar(cst,mstc_edzepr," ");

    cst="ваши все мои наши свои си такие твои те эдакие эти кои";                                       stoar(cst,mstc_mnim," ");
    cst="ваших всех моих наших своих сих таких твоих тех эдаких этих коих";                             stoar(cst,mstc_mnro," ");
    cst="вашим всем моим нашим своим сим таким твоим тем эдаким этим коим";                             stoar(cst,mstc_mnda," ");
    cst="вашими всеми моими нашими своими сими такими твоими теми эдакими этими коими";                 stoar(cst,mstc_mntv," ");
    cst="ваших всех моих наших своих сих таких твоих тех эдаких этих коих";                             stoar(cst,mstc_mnpr," ");

    cst="его ее их ея";                                                                                    stoar(cst,mstc_3e," ");
    cst="него нее них";                                                                                 stoar(cst,mstc_vip3e," ");

    # местоимения с точки зрения определения рода существительного
    cst="я ты вы мы он она оно они оне";                                                                stoar(cst,mstc_impe," ");
    cst="я мы";                                                                                         stoar(cst,mstc_im1," ");
    cst="ты вы";                                                                                        stoar(cst,mstc_im2," ");
    cst="он она оно они оне";                                                                           stoar(cst,mstc_im3," ");

    cst="да и или иль либо";                                                                            stoar(cst,soyz_iili," ");
    cst="да и";                                                                                         stoar(cst,soyz_i," ");
    cst="что";                                                                                          stoar(cst,soyz_qto," ");
    cst="как";                                                                                          stoar(cst,soyz_kak," ");
    cst="где";                                                                                          stoar(cst,soyz_gde," ");
    cst="когда";                                                                                        stoar(cst,soyz_kogda," ");

    cst="с со";                                                                                         stoar(cst,pred_s," ");
    cst="у";                                                                                            stoar(cst,pred_u," ");

    # частицы. классификация вторична, т.к. в основном  они используются все вместе через qast_any
    cst="б бы будто";                                                                                   stoar(cst,qst_by," "); # бы
    cst="хоть хотя";                                                                                    stoar(cst,qst_cn," "); # уступительные
    cst="давайте давай пускай пусть";                                                                   stoar(cst,qst_po," "); # побудительные
    cst="не ни";                                                                                        stoar(cst,qst_ne," "); # отрицательные
    cst="якобы будто мол";                                                                              stoar(cst,qst_dt," "); # сомнения
    cst="даже ни ж же ведь уж уже так там ли мол аж";                                                   stoar(cst,qst_us," "); # усилительные
    cst="только лишь почти";                                                                            stoar(cst,qst_lm," "); # ограничительные
    cst="таки то де ка те то";                                                                          stoar(cst,qst_hy," "); # дефис
    cst="де дер ди ла ле ло фон";                                                                       stoar(cst,qst_ro," "); # родительный в имена и названиях

# массив для "все"
    vse["все"];vse["Все"];vse["ВСЕ"];vsyos["всё"];vsyos["Всё"];vsyos["ВСЁ"];vsjes["все́"];vsjes["Все́"];vsjes["ВСЕ́"];
    vsyo["все"]="всё";vsyo["Все"]="Всё";vsyo["ВСЕ"]="ВСЁ";vsje["все"]="все́";vsje["Все"]="Все́";vsje["ВСЕ"]="ВСЕ́";

# сканируем стандартные базы и вычленяем из них нужное
# глаголы с признаками модальности (во всяком случае требуют после себя инфинитива)
 cst="алкать броситься быть велеть готовиться догадаться жаждать желать заканчивать закончить заставить захотеть идти изволить кончать кончить любить мочь надеяться \
      надлежать начать начинать норовить обещать отослать отправить отсылать переставать перестать побежать пойти помогать помочь попросить послать поспешить \
      поставить постараться посылать предпочить прекратить прекращать прийтись приказать приказывать продолжать продолжить просить решить следовать смочь собираться \
      собраться спешить стараться стать суметь торопиться уметь умудриться успеть ходить хотеть хотеться";
 stoar(cst,md_gl," "); #

# вспомогательные глаголы для форм с причастиями
 cst="будет буду будут был была были было быть есть";
 stoar(cst,gla_be," "); #

# вспомогательные глаголы-связки
 cst="быть стать являться";
 stoar(cst,link_gl," "); #

 # партитивы --> dic
 # _pa_abst FLAT
 cst="бледноты боли бою брани бреду быстрины быстроты величины весу вкусноты войны высоты вышины глубины глушины гнуси грусти длины дури духоты духу жару закуси \
      красоты круглоты мути остроты пинка пресноты пустоты пылу светлоты свету седины скорби сухоты току толщины тона треску ходу холода цвету частоты шагу ширины \
      широты";
 stoar(cst,ispa_abst," "); stoar(cst,ispa_any," "); #

 # _pa_food FLAT
 cst="ветчины говна дури закуси зелени земли извести икры колбасы корму крови крупы лука луку манки меду мелу муки свежины смеси смолы снегу соли травы трески хлеба";
 stoar(cst,ispa_food," "); stoar(cst,ispa_any," "); #

 # _pa_gas FLAT
 cst="ветру газу дыму жару пылу";
 stoar(cst,ispa_gas," "); stoar(cst,ispa_any," "); #

 # _pa_liquid FLAT
 cst="вина виски воды гною говна железа жиру кислоты клею колы крови меду молока молочка мути надкислоты оксикислоты перкислоты пива пирокислоты поликислоты \
      полиоксиаминокислоты полиоксикислоты поту псевдокислоты росы смолы соку соли спирту туши углекислоты фульвокислоты хмелю чайку";
 stoar(cst,ispa_liquid," "); stoar(cst,ispa_any," "); #

 # _pa_loose FLAT
 cst="гидрослюды говна дроби жару зелени земли извести икры корму кости крупы лозы лука луку манки меду муки перцу пыли руды сахару слюды смеси смоли снегу сосны \
      травы хлеба хмелю шерсти щепы";
 stoar(cst,ispa_loose," "); stoar(cst,ispa_any," "); #

 # _pa_solid FLAT
 cst="ветчины гидрослюды железа зелени земли колбасы корму кости лозы лука луку меду мелу меху руды свежины слюды смолы снегу сосны травы трески хлеба шелку щепы";
 stoar(cst,ispa_solid," "); stoar(cst,ispa_any," "); #


}
