# Скрипт для замены поисковых элементов основного sed-скрипта исправляения ошибок (gtts.sed)
# Громоздкие элементы и служебные элементы заменены ключами, понятными человеку

 s=\{1-2\}=\\xcc\\xa0\\xcc\\xad=gI       # regex"(\w)\u0320\u032D"="$1$1"
 s=\{Г-В\}=\\xcc\\xa0=gI                 # regex"[Гг]\u0320"="в"
 s=\{Ь_\}=\\xcc\\xa0\\xcc\\xa3=gI        # regex"(\w)\u0320\u0323"="ь$1"
 s=\{Ъ_\}=\\xcc\\xa0\\xcc\\xa4=gI        # regex"(\w)\u0320\u0324"="ъ$1"
 s=\{Ч-Ш\}=\\xcc\\xad\\xcc\\xa3=gI       # regex"[Чч]\u032d\u0323"="ш"
 s=\{[ЗЖСШ]Ч-Щ\}=\\xcc\\xa4\\xcc\\xad=gI # regex"[ЗзЖжСсШш][Чч]\u0320\u032d"="щ"
 s=\{ТС-Ц\}=\\xcc\\xa0=gI                # regex"[Тт][Сс]\u0320\u032d"="ц"
 s=\{Ё-О\}=\\xcc\\xa0=gI                 # regex"[Ёё](\u0301?)\u0320"="о$1"
 s=\{Ё-ЬО\}=\\xcc\\xa3\\xcc\\xad=gI      # regex"[Ёё](\u0301?)\u0323\u032D"="ьо$1"
 s=\{Ё-ЙО\}=\\xcc\\xa4\\xcc\\xad=gI      # regex"[Ёё](\u0301?)\u0324\u032D"="йо$1"
 s=\{Е-Э\}=\\xcc\\xa0=gI                 # regex"[Ее](\u0301?)\u0320"="э$1"
 s=\{Е-ЬЭ\}=\\xcc\\xad\\xcc\\xa0=gI      # regex"[Ее](\u0301?)\u032d\u0320"="ьэ$1"
 s=\{Е-ЙЭ\}=\\xcc\\xa3\\xcc\\xa0=gI      # regex"[Ее](\u0301?)\u0323\u0320"="йэ$1"
 s=\{Е-ЙЕ\}=\\xcc\\xb0\\xcc\\xa0=gI      # regex"[Ее](\u0301?)\u0330\u0320"="йе$1"
 s=\{Е-И\}=\\xcc\\xad\\xcc\\xad=gI       # regex"[Ее]\u032d\u032D"="и$1"
 s=\{О-А\}=\\xcc\\xa0=gI                 # regex"[Оо]\u0320"="а"
 s=\{Э-Е\}=\\xcc\\xa0=gI                 # regex"[Ээ](\u0301?)\u0320"="е$1"
 s=\{Ю-ЙУ\}=\\xcc\\xa0=gI                # regex"[Юю](\u0301?)\u0320"="йу$1"
 s=\{Ю-ЬУ\}=\\xcc\\xad=gI                # regex"[Юю](\u0301?)\u032D"="ьу$1"
 s=\{Я-ЙА\}=\\xcc\\xa0=gI                # regex"[Яя](\u0301?)\u0320"="йа$1"
 s=\{Я-ЬА\}=\\xcc\\xad=gI                # regex"[Яя](\u0301?)\u032D"="ьа$1"
 s=\{Я-ЪА\}=\\xcc\\xa4\\xcc\\xad=gI      # regex"[Яя](\u0301?)\u0324\u032D"="ъа$1"
 s=\{Я-И\}=\\xcc\\xa3\\xcc\\xad=gI       # regex"[Яя]\u0323\u032D"="и$1"
 s=\{0\}=\\xcc\\xa0=gI                   # regex"\s\\xcc\\xa0(.)"="$1"
 s=\{Ь\}=\\xcc\\xa3=gI                   # regex"\u0323"="ь"
 s=\{Ъ\}=\\xcc\\xa4=gI                   # regex"\u0324"="ъ"
 s=\{Й\}=\\xcc\\xb0=gI                   # regex"\u0330"="й"
 s=\{-\}=\\xcc\\xad\\xcc\\xa0=gI         # regex"\u032D\u0320"="-"
#s=\{0\}=\\xcc\\xa0=gI                   # regex"-\u0320"=""


 s=\{RUUC\}=АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ=g
 s=\{rulc\}=абвгдеёжзийклмнопрстуфхцчшщъыьэюя=g
#s=\{RUCl\}=АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя=g
 s=\{UNXC\}=\\xcc\\x81\\xcc\\xa0\\xcc\\xa3\\xcc\\xa4\\xcc\\xad\\xcc\\xb0=gI
 s=\{NOTWORD\}=[^АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя\\xcc\\x81\\xcc\\xa0\\xcc\\xa3\\xcc\\xa4\\xcc\\xad\\xcc\\xb0]=g
 s=\{ISWORD\}=[АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя\\xcc\\x81\\xcc\\xa0\\xcc\\xa3\\xcc\\xa4\\xcc\\xad\\xcc\\xb0]=g
 s=\{notword\}=[^абвгдеёжзийклмнопрстуфхцчшщъыьэюя\\xcc\\x81\\xcc\\xa0\\xcc\\xa3\\xcc\\xa4\\xcc\\xad\\xcc\\xb0]=g
 s=\{isword\}=[абвгдеёжзийклмнопрстуфхцчшщъыьэюя\\xcc\\x81\\xcc\\xa0\\xcc\\xa3\\xcc\\xa4\\xcc\\xad\\xcc\\xb0]=g
 s=\{ST\}=\\xcc\\x81=gI
 s=\{XA0\}=\\xcc\\xa0=gI
 s=\{XA4\}=\\xe2\\x80\\xa4=gI
 s=\{XA7\}=\\xe2\\x80\\xa7=gI

